konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/io_bank0.inc
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO11_STATUS_OUTTOPAD
# Description : output signal to pad after register override is applied
.equ	IO_BANK0_GPIO11_STATUS_OUTTOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO11_STATUS_OUTTOPAD_BITS, 0x00000200
.equ	IO_BANK0_GPIO11_STATUS_OUTTOPAD_MSB, 9
.equ	IO_BANK0_GPIO11_STATUS_OUTTOPAD_LSB, 9
# =============================================================================
# Register    : IO_BANK0_GPIO11_CTRL
.equ	IO_BANK0_GPIO11_CTRL_OFFSET, 0x0000005c
.equ	IO_BANK0_GPIO11_CTRL_BITS, 0x3003f01f
.equ	IO_BANK0_GPIO11_CTRL_RESET, 0x0000001f
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO11_CTRL_IRQOVER
#               0x0 -> don't invert the interrupt
#               0x1 -> invert the interrupt
#               0x2 -> drive interrupt low
#               0x3 -> drive interrupt high
.equ	IO_BANK0_GPIO11_CTRL_IRQOVER_RESET, 0x0
.equ	IO_BANK0_GPIO11_CTRL_IRQOVER_BITS, 0x30000000
.equ	IO_BANK0_GPIO11_CTRL_IRQOVER_MSB, 29
.equ	IO_BANK0_GPIO11_CTRL_IRQOVER_LSB, 28
.equ	IO_BANK0_GPIO11_CTRL_IRQOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO11_CTRL_IRQOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO11_CTRL_IRQOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO11_CTRL_IRQOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO11_CTRL_INOVER
#               0x0 -> don't invert the peri input
#               0x1 -> invert the peri input
#               0x2 -> drive peri input low
#               0x3 -> drive peri input high
.equ	IO_BANK0_GPIO11_CTRL_INOVER_RESET, 0x0
.equ	IO_BANK0_GPIO11_CTRL_INOVER_BITS, 0x00030000
.equ	IO_BANK0_GPIO11_CTRL_INOVER_MSB, 17
.equ	IO_BANK0_GPIO11_CTRL_INOVER_LSB, 16
.equ	IO_BANK0_GPIO11_CTRL_INOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO11_CTRL_INOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO11_CTRL_INOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO11_CTRL_INOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO11_CTRL_OEOVER
#               0x0 -> drive output enable from peripheral signal selected by funcsel
#               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
#               0x2 -> disable output
#               0x3 -> enable output
.equ	IO_BANK0_GPIO11_CTRL_OEOVER_RESET, 0x0
.equ	IO_BANK0_GPIO11_CTRL_OEOVER_BITS, 0x0000c000
.equ	IO_BANK0_GPIO11_CTRL_OEOVER_MSB, 15
.equ	IO_BANK0_GPIO11_CTRL_OEOVER_LSB, 14
.equ	IO_BANK0_GPIO11_CTRL_OEOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO11_CTRL_OEOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO11_CTRL_OEOVER_VALUE_DISABLE, 0x2
.equ	IO_BANK0_GPIO11_CTRL_OEOVER_VALUE_ENABLE, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO11_CTRL_OUTOVER
#               0x0 -> drive output from peripheral signal selected by funcsel
#               0x1 -> drive output from inverse of peripheral signal selected by funcsel
#               0x2 -> drive output low
#               0x3 -> drive output high
.equ	IO_BANK0_GPIO11_CTRL_OUTOVER_RESET, 0x0
.equ	IO_BANK0_GPIO11_CTRL_OUTOVER_BITS, 0x00003000
.equ	IO_BANK0_GPIO11_CTRL_OUTOVER_MSB, 13
.equ	IO_BANK0_GPIO11_CTRL_OUTOVER_LSB, 12
.equ	IO_BANK0_GPIO11_CTRL_OUTOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO11_CTRL_OUTOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO11_CTRL_OUTOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO11_CTRL_OUTOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO11_CTRL_FUNCSEL
# Description : 0-31 -> selects pin function according to the gpio table
#               31 == NULL
#               0x01 -> spi1_tx
#               0x02 -> uart1_rts
#               0x03 -> i2c1_scl
#               0x04 -> pwm_b_5
#               0x05 -> siob_proc_11
#               0x06 -> pio0_11
#               0x07 -> pio1_11
#               0x08 -> pio2_11
#               0x0a -> usb_muxing_vbus_en
#               0x0b -> uart1_rx
#               0x1f -> null
.equ	IO_BANK0_GPIO11_CTRL_FUNCSEL_RESET, 0x1f
.equ	IO_BANK0_GPIO11_CTRL_FUNCSEL_BITS, 0x0000001f
.equ	IO_BANK0_GPIO11_CTRL_FUNCSEL_MSB, 4
.equ	IO_BANK0_GPIO11_CTRL_FUNCSEL_LSB, 0
.equ	IO_BANK0_GPIO11_CTRL_FUNCSEL_VALUE_SPI1_TX, 0x01
.equ	IO_BANK0_GPIO11_CTRL_FUNCSEL_VALUE_UART1_RTS, 0x02
.equ	IO_BANK0_GPIO11_CTRL_FUNCSEL_VALUE_I2C1_SCL, 0x03
.equ	IO_BANK0_GPIO11_CTRL_FUNCSEL_VALUE_PWM_B_5, 0x04
.equ	IO_BANK0_GPIO11_CTRL_FUNCSEL_VALUE_SIOB_PROC_11, 0x05
.equ	IO_BANK0_GPIO11_CTRL_FUNCSEL_VALUE_PIO0_11, 0x06
.equ	IO_BANK0_GPIO11_CTRL_FUNCSEL_VALUE_PIO1_11, 0x07
.equ	IO_BANK0_GPIO11_CTRL_FUNCSEL_VALUE_PIO2_11, 0x08
.equ	IO_BANK0_GPIO11_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_EN, 0x0a
.equ	IO_BANK0_GPIO11_CTRL_FUNCSEL_VALUE_UART1_RX, 0x0b
.equ	IO_BANK0_GPIO11_CTRL_FUNCSEL_VALUE_NULL, 0x1f
# =============================================================================
# Register    : IO_BANK0_GPIO12_STATUS
.equ	IO_BANK0_GPIO12_STATUS_OFFSET, 0x00000060
.equ	IO_BANK0_GPIO12_STATUS_BITS, 0x04022200
.equ	IO_BANK0_GPIO12_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO12_STATUS_IRQTOPROC
# Description : interrupt to processors, after override is applied
.equ	IO_BANK0_GPIO12_STATUS_IRQTOPROC_RESET, 0x0
.equ	IO_BANK0_GPIO12_STATUS_IRQTOPROC_BITS, 0x04000000
.equ	IO_BANK0_GPIO12_STATUS_IRQTOPROC_MSB, 26
.equ	IO_BANK0_GPIO12_STATUS_IRQTOPROC_LSB, 26
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO12_STATUS_INFROMPAD
# Description : input signal from pad, before filtering and override are
#               applied
.equ	IO_BANK0_GPIO12_STATUS_INFROMPAD_RESET, 0x0
.equ	IO_BANK0_GPIO12_STATUS_INFROMPAD_BITS, 0x00020000
.equ	IO_BANK0_GPIO12_STATUS_INFROMPAD_MSB, 17
.equ	IO_BANK0_GPIO12_STATUS_INFROMPAD_LSB, 17
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO12_STATUS_OETOPAD
# Description : output enable to pad after register override is applied
.equ	IO_BANK0_GPIO12_STATUS_OETOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO12_STATUS_OETOPAD_BITS, 0x00002000
.equ	IO_BANK0_GPIO12_STATUS_OETOPAD_MSB, 13
.equ	IO_BANK0_GPIO12_STATUS_OETOPAD_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO12_STATUS_OUTTOPAD
# Description : output signal to pad after register override is applied
.equ	IO_BANK0_GPIO12_STATUS_OUTTOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO12_STATUS_OUTTOPAD_BITS, 0x00000200
.equ	IO_BANK0_GPIO12_STATUS_OUTTOPAD_MSB, 9
.equ	IO_BANK0_GPIO12_STATUS_OUTTOPAD_LSB, 9
# =============================================================================
# Register    : IO_BANK0_GPIO12_CTRL
.equ	IO_BANK0_GPIO12_CTRL_OFFSET, 0x00000064
.equ	IO_BANK0_GPIO12_CTRL_BITS, 0x3003f01f
.equ	IO_BANK0_GPIO12_CTRL_RESET, 0x0000001f
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO12_CTRL_IRQOVER
#               0x0 -> don't invert the interrupt
#               0x1 -> invert the interrupt
#               0x2 -> drive interrupt low
#               0x3 -> drive interrupt high
.equ	IO_BANK0_GPIO12_CTRL_IRQOVER_RESET, 0x0
.equ	IO_BANK0_GPIO12_CTRL_IRQOVER_BITS, 0x30000000
.equ	IO_BANK0_GPIO12_CTRL_IRQOVER_MSB, 29
.equ	IO_BANK0_GPIO12_CTRL_IRQOVER_LSB, 28
.equ	IO_BANK0_GPIO12_CTRL_IRQOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO12_CTRL_IRQOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO12_CTRL_IRQOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO12_CTRL_IRQOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO12_CTRL_INOVER
#               0x0 -> don't invert the peri input
#               0x1 -> invert the peri input
#               0x2 -> drive peri input low
#               0x3 -> drive peri input high
.equ	IO_BANK0_GPIO12_CTRL_INOVER_RESET, 0x0
.equ	IO_BANK0_GPIO12_CTRL_INOVER_BITS, 0x00030000
.equ	IO_BANK0_GPIO12_CTRL_INOVER_MSB, 17
.equ	IO_BANK0_GPIO12_CTRL_INOVER_LSB, 16
.equ	IO_BANK0_GPIO12_CTRL_INOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO12_CTRL_INOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO12_CTRL_INOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO12_CTRL_INOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO12_CTRL_OEOVER
#               0x0 -> drive output enable from peripheral signal selected by funcsel
#               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
#               0x2 -> disable output
#               0x3 -> enable output
.equ	IO_BANK0_GPIO12_CTRL_OEOVER_RESET, 0x0
.equ	IO_BANK0_GPIO12_CTRL_OEOVER_BITS, 0x0000c000
.equ	IO_BANK0_GPIO12_CTRL_OEOVER_MSB, 15
.equ	IO_BANK0_GPIO12_CTRL_OEOVER_LSB, 14
.equ	IO_BANK0_GPIO12_CTRL_OEOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO12_CTRL_OEOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO12_CTRL_OEOVER_VALUE_DISABLE, 0x2
.equ	IO_BANK0_GPIO12_CTRL_OEOVER_VALUE_ENABLE, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO12_CTRL_OUTOVER
#               0x0 -> drive output from peripheral signal selected by funcsel
#               0x1 -> drive output from inverse of peripheral signal selected by funcsel
#               0x2 -> drive output low
#               0x3 -> drive output high
.equ	IO_BANK0_GPIO12_CTRL_OUTOVER_RESET, 0x0
.equ	IO_BANK0_GPIO12_CTRL_OUTOVER_BITS, 0x00003000
.equ	IO_BANK0_GPIO12_CTRL_OUTOVER_MSB, 13
.equ	IO_BANK0_GPIO12_CTRL_OUTOVER_LSB, 12
.equ	IO_BANK0_GPIO12_CTRL_OUTOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO12_CTRL_OUTOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO12_CTRL_OUTOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO12_CTRL_OUTOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO12_CTRL_FUNCSEL
# Description : 0-31 -> selects pin function according to the gpio table
#               31 == NULL
#               0x00 -> hstx_0
#               0x01 -> spi1_rx
#               0x02 -> uart0_tx
#               0x03 -> i2c0_sda
#               0x04 -> pwm_a_6
#               0x05 -> siob_proc_12
#               0x06 -> pio0_12
#               0x07 -> pio1_12
#               0x08 -> pio2_12
#               0x09 -> clocks_gpin_0
#               0x0a -> usb_muxing_overcurr_detect
#               0x1f -> null
.equ	IO_BANK0_GPIO12_CTRL_FUNCSEL_RESET, 0x1f
.equ	IO_BANK0_GPIO12_CTRL_FUNCSEL_BITS, 0x0000001f
.equ	IO_BANK0_GPIO12_CTRL_FUNCSEL_MSB, 4
.equ	IO_BANK0_GPIO12_CTRL_FUNCSEL_LSB, 0
.equ	IO_BANK0_GPIO12_CTRL_FUNCSEL_VALUE_HSTX_0, 0x00
.equ	IO_BANK0_GPIO12_CTRL_FUNCSEL_VALUE_SPI1_RX, 0x01
.equ	IO_BANK0_GPIO12_CTRL_FUNCSEL_VALUE_UART0_TX, 0x02
.equ	IO_BANK0_GPIO12_CTRL_FUNCSEL_VALUE_I2C0_SDA, 0x03
.equ	IO_BANK0_GPIO12_CTRL_FUNCSEL_VALUE_PWM_A_6, 0x04
.equ	IO_BANK0_GPIO12_CTRL_FUNCSEL_VALUE_SIOB_PROC_12, 0x05
.equ	IO_BANK0_GPIO12_CTRL_FUNCSEL_VALUE_PIO0_12, 0x06
.equ	IO_BANK0_GPIO12_CTRL_FUNCSEL_VALUE_PIO1_12, 0x07
.equ	IO_BANK0_GPIO12_CTRL_FUNCSEL_VALUE_PIO2_12, 0x08
.equ	IO_BANK0_GPIO12_CTRL_FUNCSEL_VALUE_CLOCKS_GPIN_0, 0x09
.equ	IO_BANK0_GPIO12_CTRL_FUNCSEL_VALUE_USB_MUXING_OVERCURR_DETECT, 0x0a
.equ	IO_BANK0_GPIO12_CTRL_FUNCSEL_VALUE_NULL, 0x1f
# =============================================================================
# Register    : IO_BANK0_GPIO13_STATUS
.equ	IO_BANK0_GPIO13_STATUS_OFFSET, 0x00000068
.equ	IO_BANK0_GPIO13_STATUS_BITS, 0x04022200
.equ	IO_BANK0_GPIO13_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO13_STATUS_IRQTOPROC
# Description : interrupt to processors, after override is applied
.equ	IO_BANK0_GPIO13_STATUS_IRQTOPROC_RESET, 0x0
.equ	IO_BANK0_GPIO13_STATUS_IRQTOPROC_BITS, 0x04000000
.equ	IO_BANK0_GPIO13_STATUS_IRQTOPROC_MSB, 26
.equ	IO_BANK0_GPIO13_STATUS_IRQTOPROC_LSB, 26
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO13_STATUS_INFROMPAD
# Description : input signal from pad, before filtering and override are
#               applied
.equ	IO_BANK0_GPIO13_STATUS_INFROMPAD_RESET, 0x0
.equ	IO_BANK0_GPIO13_STATUS_INFROMPAD_BITS, 0x00020000
.equ	IO_BANK0_GPIO13_STATUS_INFROMPAD_MSB, 17
.equ	IO_BANK0_GPIO13_STATUS_INFROMPAD_LSB, 17
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO13_STATUS_OETOPAD
# Description : output enable to pad after register override is applied
.equ	IO_BANK0_GPIO13_STATUS_OETOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO13_STATUS_OETOPAD_BITS, 0x00002000
.equ	IO_BANK0_GPIO13_STATUS_OETOPAD_MSB, 13
.equ	IO_BANK0_GPIO13_STATUS_OETOPAD_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO13_STATUS_OUTTOPAD
# Description : output signal to pad after register override is applied
.equ	IO_BANK0_GPIO13_STATUS_OUTTOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO13_STATUS_OUTTOPAD_BITS, 0x00000200
.equ	IO_BANK0_GPIO13_STATUS_OUTTOPAD_MSB, 9
.equ	IO_BANK0_GPIO13_STATUS_OUTTOPAD_LSB, 9
# =============================================================================
# Register    : IO_BANK0_GPIO13_CTRL
.equ	IO_BANK0_GPIO13_CTRL_OFFSET, 0x0000006c
.equ	IO_BANK0_GPIO13_CTRL_BITS, 0x3003f01f
.equ	IO_BANK0_GPIO13_CTRL_RESET, 0x0000001f
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO13_CTRL_IRQOVER
#               0x0 -> don't invert the interrupt
#               0x1 -> invert the interrupt
#               0x2 -> drive interrupt low
#               0x3 -> drive interrupt high
.equ	IO_BANK0_GPIO13_CTRL_IRQOVER_RESET, 0x0
.equ	IO_BANK0_GPIO13_CTRL_IRQOVER_BITS, 0x30000000
.equ	IO_BANK0_GPIO13_CTRL_IRQOVER_MSB, 29
.equ	IO_BANK0_GPIO13_CTRL_IRQOVER_LSB, 28
.equ	IO_BANK0_GPIO13_CTRL_IRQOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO13_CTRL_IRQOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO13_CTRL_IRQOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO13_CTRL_IRQOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO13_CTRL_INOVER
#               0x0 -> don't invert the peri input
#               0x1 -> invert the peri input
#               0x2 -> drive peri input low
#               0x3 -> drive peri input high
.equ	IO_BANK0_GPIO13_CTRL_INOVER_RESET, 0x0
.equ	IO_BANK0_GPIO13_CTRL_INOVER_BITS, 0x00030000
.equ	IO_BANK0_GPIO13_CTRL_INOVER_MSB, 17
.equ	IO_BANK0_GPIO13_CTRL_INOVER_LSB, 16
.equ	IO_BANK0_GPIO13_CTRL_INOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO13_CTRL_INOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO13_CTRL_INOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO13_CTRL_INOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO13_CTRL_OEOVER
#               0x0 -> drive output enable from peripheral signal selected by funcsel
#               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
#               0x2 -> disable output
#               0x3 -> enable output
.equ	IO_BANK0_GPIO13_CTRL_OEOVER_RESET, 0x0
.equ	IO_BANK0_GPIO13_CTRL_OEOVER_BITS, 0x0000c000
.equ	IO_BANK0_GPIO13_CTRL_OEOVER_MSB, 15
.equ	IO_BANK0_GPIO13_CTRL_OEOVER_LSB, 14
.equ	IO_BANK0_GPIO13_CTRL_OEOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO13_CTRL_OEOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO13_CTRL_OEOVER_VALUE_DISABLE, 0x2
.equ	IO_BANK0_GPIO13_CTRL_OEOVER_VALUE_ENABLE, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO13_CTRL_OUTOVER
#               0x0 -> drive output from peripheral signal selected by funcsel
#               0x1 -> drive output from inverse of peripheral signal selected by funcsel
#               0x2 -> drive output low
#               0x3 -> drive output high
.equ	IO_BANK0_GPIO13_CTRL_OUTOVER_RESET, 0x0
.equ	IO_BANK0_GPIO13_CTRL_OUTOVER_BITS, 0x00003000
.equ	IO_BANK0_GPIO13_CTRL_OUTOVER_MSB, 13
.equ	IO_BANK0_GPIO13_CTRL_OUTOVER_LSB, 12
.equ	IO_BANK0_GPIO13_CTRL_OUTOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO13_CTRL_OUTOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO13_CTRL_OUTOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO13_CTRL_OUTOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO13_CTRL_FUNCSEL
# Description : 0-31 -> selects pin function according to the gpio table
#               31 == NULL
#               0x00 -> hstx_1
#               0x01 -> spi1_ss_n
#               0x02 -> uart0_rx
#               0x03 -> i2c0_scl
#               0x04 -> pwm_b_6
#               0x05 -> siob_proc_13
#               0x06 -> pio0_13
#               0x07 -> pio1_13
#               0x08 -> pio2_13
#               0x09 -> clocks_gpout_0
#               0x0a -> usb_muxing_vbus_detect
#               0x1f -> null
.equ	IO_BANK0_GPIO13_CTRL_FUNCSEL_RESET, 0x1f
.equ	IO_BANK0_GPIO13_CTRL_FUNCSEL_BITS, 0x0000001f
.equ	IO_BANK0_GPIO13_CTRL_FUNCSEL_MSB, 4
.equ	IO_BANK0_GPIO13_CTRL_FUNCSEL_LSB, 0
.equ	IO_BANK0_GPIO13_CTRL_FUNCSEL_VALUE_HSTX_1, 0x00
.equ	IO_BANK0_GPIO13_CTRL_FUNCSEL_VALUE_SPI1_SS_N, 0x01
.equ	IO_BANK0_GPIO13_CTRL_FUNCSEL_VALUE_UART0_RX, 0x02
.equ	IO_BANK0_GPIO13_CTRL_FUNCSEL_VALUE_I2C0_SCL, 0x03
.equ	IO_BANK0_GPIO13_CTRL_FUNCSEL_VALUE_PWM_B_6, 0x04
.equ	IO_BANK0_GPIO13_CTRL_FUNCSEL_VALUE_SIOB_PROC_13, 0x05
.equ	IO_BANK0_GPIO13_CTRL_FUNCSEL_VALUE_PIO0_13, 0x06
.equ	IO_BANK0_GPIO13_CTRL_FUNCSEL_VALUE_PIO1_13, 0x07
.equ	IO_BANK0_GPIO13_CTRL_FUNCSEL_VALUE_PIO2_13, 0x08
.equ	IO_BANK0_GPIO13_CTRL_FUNCSEL_VALUE_CLOCKS_GPOUT_0, 0x09
.equ	IO_BANK0_GPIO13_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_DETECT, 0x0a
.equ	IO_BANK0_GPIO13_CTRL_FUNCSEL_VALUE_NULL, 0x1f
# =============================================================================
# Register    : IO_BANK0_GPIO14_STATUS
.equ	IO_BANK0_GPIO14_STATUS_OFFSET, 0x00000070
.equ	IO_BANK0_GPIO14_STATUS_BITS, 0x04022200
.equ	IO_BANK0_GPIO14_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO14_STATUS_IRQTOPROC
# Description : interrupt to processors, after override is applied
.equ	IO_BANK0_GPIO14_STATUS_IRQTOPROC_RESET, 0x0
.equ	IO_BANK0_GPIO14_STATUS_IRQTOPROC_BITS, 0x04000000
.equ	IO_BANK0_GPIO14_STATUS_IRQTOPROC_MSB, 26
.equ	IO_BANK0_GPIO14_STATUS_IRQTOPROC_LSB, 26
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO14_STATUS_INFROMPAD
# Description : input signal from pad, before filtering and override are
#               applied
.equ	IO_BANK0_GPIO14_STATUS_INFROMPAD_RESET, 0x0
.equ	IO_BANK0_GPIO14_STATUS_INFROMPAD_BITS, 0x00020000
.equ	IO_BANK0_GPIO14_STATUS_INFROMPAD_MSB, 17
.equ	IO_BANK0_GPIO14_STATUS_INFROMPAD_LSB, 17
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO14_STATUS_OETOPAD
# Description : output enable to pad after register override is applied
.equ	IO_BANK0_GPIO14_STATUS_OETOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO14_STATUS_OETOPAD_BITS, 0x00002000
.equ	IO_BANK0_GPIO14_STATUS_OETOPAD_MSB, 13
.equ	IO_BANK0_GPIO14_STATUS_OETOPAD_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO14_STATUS_OUTTOPAD
# Description : output signal to pad after register override is applied
.equ	IO_BANK0_GPIO14_STATUS_OUTTOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO14_STATUS_OUTTOPAD_BITS, 0x00000200
.equ	IO_BANK0_GPIO14_STATUS_OUTTOPAD_MSB, 9
.equ	IO_BANK0_GPIO14_STATUS_OUTTOPAD_LSB, 9
# =============================================================================
# Register    : IO_BANK0_GPIO14_CTRL
.equ	IO_BANK0_GPIO14_CTRL_OFFSET, 0x00000074
.equ	IO_BANK0_GPIO14_CTRL_BITS, 0x3003f01f
.equ	IO_BANK0_GPIO14_CTRL_RESET, 0x0000001f
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO14_CTRL_IRQOVER
#               0x0 -> don't invert the interrupt
#               0x1 -> invert the interrupt
#               0x2 -> drive interrupt low
#               0x3 -> drive interrupt high
.equ	IO_BANK0_GPIO14_CTRL_IRQOVER_RESET, 0x0
.equ	IO_BANK0_GPIO14_CTRL_IRQOVER_BITS, 0x30000000
.equ	IO_BANK0_GPIO14_CTRL_IRQOVER_MSB, 29
.equ	IO_BANK0_GPIO14_CTRL_IRQOVER_LSB, 28
.equ	IO_BANK0_GPIO14_CTRL_IRQOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO14_CTRL_IRQOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO14_CTRL_IRQOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO14_CTRL_IRQOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO14_CTRL_INOVER
#               0x0 -> don't invert the peri input
#               0x1 -> invert the peri input
#               0x2 -> drive peri input low
#               0x3 -> drive peri input high
.equ	IO_BANK0_GPIO14_CTRL_INOVER_RESET, 0x0
.equ	IO_BANK0_GPIO14_CTRL_INOVER_BITS, 0x00030000
.equ	IO_BANK0_GPIO14_CTRL_INOVER_MSB, 17
.equ	IO_BANK0_GPIO14_CTRL_INOVER_LSB, 16
.equ	IO_BANK0_GPIO14_CTRL_INOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO14_CTRL_INOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO14_CTRL_INOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO14_CTRL_INOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO14_CTRL_OEOVER
#               0x0 -> drive output enable from peripheral signal selected by funcsel
#               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
#               0x2 -> disable output
#               0x3 -> enable output
.equ	IO_BANK0_GPIO14_CTRL_OEOVER_RESET, 0x0
.equ	IO_BANK0_GPIO14_CTRL_OEOVER_BITS, 0x0000c000
.equ	IO_BANK0_GPIO14_CTRL_OEOVER_MSB, 15
.equ	IO_BANK0_GPIO14_CTRL_OEOVER_LSB, 14
.equ	IO_BANK0_GPIO14_CTRL_OEOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO14_CTRL_OEOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO14_CTRL_OEOVER_VALUE_DISABLE, 0x2
.equ	IO_BANK0_GPIO14_CTRL_OEOVER_VALUE_ENABLE, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO14_CTRL_OUTOVER
#               0x0 -> drive output from peripheral signal selected by funcsel
#               0x1 -> drive output from inverse of peripheral signal selected by funcsel
#               0x2 -> drive output low
#               0x3 -> drive output high
.equ	IO_BANK0_GPIO14_CTRL_OUTOVER_RESET, 0x0
.equ	IO_BANK0_GPIO14_CTRL_OUTOVER_BITS, 0x00003000
.equ	IO_BANK0_GPIO14_CTRL_OUTOVER_MSB, 13
.equ	IO_BANK0_GPIO14_CTRL_OUTOVER_LSB, 12
.equ	IO_BANK0_GPIO14_CTRL_OUTOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO14_CTRL_OUTOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO14_CTRL_OUTOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO14_CTRL_OUTOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO14_CTRL_FUNCSEL
# Description : 0-31 -> selects pin function according to the gpio table
#               31 == NULL
#               0x00 -> hstx_2
#               0x01 -> spi1_sclk
#               0x02 -> uart0_cts
#               0x03 -> i2c1_sda
#               0x04 -> pwm_a_7
#               0x05 -> siob_proc_14
#               0x06 -> pio0_14
#               0x07 -> pio1_14
#               0x08 -> pio2_14
#               0x09 -> clocks_gpin_1
#               0x0a -> usb_muxing_vbus_en
#               0x0b -> uart0_tx
#               0x1f -> null
.equ	IO_BANK0_GPIO14_CTRL_FUNCSEL_RESET, 0x1f
.equ	IO_BANK0_GPIO14_CTRL_FUNCSEL_BITS, 0x0000001f
.equ	IO_BANK0_GPIO14_CTRL_FUNCSEL_MSB, 4
.equ	IO_BANK0_GPIO14_CTRL_FUNCSEL_LSB, 0
.equ	IO_BANK0_GPIO14_CTRL_FUNCSEL_VALUE_HSTX_2, 0x00
.equ	IO_BANK0_GPIO14_CTRL_FUNCSEL_VALUE_SPI1_SCLK, 0x01
.equ	IO_BANK0_GPIO14_CTRL_FUNCSEL_VALUE_UART0_CTS, 0x02
.equ	IO_BANK0_GPIO14_CTRL_FUNCSEL_VALUE_I2C1_SDA, 0x03
.equ	IO_BANK0_GPIO14_CTRL_FUNCSEL_VALUE_PWM_A_7, 0x04
