konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/io_bank0.inc
.equ	IO_BANK0_GPIO14_CTRL_FUNCSEL_VALUE_SIOB_PROC_14, 0x05
.equ	IO_BANK0_GPIO14_CTRL_FUNCSEL_VALUE_PIO0_14, 0x06
.equ	IO_BANK0_GPIO14_CTRL_FUNCSEL_VALUE_PIO1_14, 0x07
.equ	IO_BANK0_GPIO14_CTRL_FUNCSEL_VALUE_PIO2_14, 0x08
.equ	IO_BANK0_GPIO14_CTRL_FUNCSEL_VALUE_CLOCKS_GPIN_1, 0x09
.equ	IO_BANK0_GPIO14_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_EN, 0x0a
.equ	IO_BANK0_GPIO14_CTRL_FUNCSEL_VALUE_UART0_TX, 0x0b
.equ	IO_BANK0_GPIO14_CTRL_FUNCSEL_VALUE_NULL, 0x1f
# =============================================================================
# Register    : IO_BANK0_GPIO15_STATUS
.equ	IO_BANK0_GPIO15_STATUS_OFFSET, 0x00000078
.equ	IO_BANK0_GPIO15_STATUS_BITS, 0x04022200
.equ	IO_BANK0_GPIO15_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO15_STATUS_IRQTOPROC
# Description : interrupt to processors, after override is applied
.equ	IO_BANK0_GPIO15_STATUS_IRQTOPROC_RESET, 0x0
.equ	IO_BANK0_GPIO15_STATUS_IRQTOPROC_BITS, 0x04000000
.equ	IO_BANK0_GPIO15_STATUS_IRQTOPROC_MSB, 26
.equ	IO_BANK0_GPIO15_STATUS_IRQTOPROC_LSB, 26
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO15_STATUS_INFROMPAD
# Description : input signal from pad, before filtering and override are
#               applied
.equ	IO_BANK0_GPIO15_STATUS_INFROMPAD_RESET, 0x0
.equ	IO_BANK0_GPIO15_STATUS_INFROMPAD_BITS, 0x00020000
.equ	IO_BANK0_GPIO15_STATUS_INFROMPAD_MSB, 17
.equ	IO_BANK0_GPIO15_STATUS_INFROMPAD_LSB, 17
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO15_STATUS_OETOPAD
# Description : output enable to pad after register override is applied
.equ	IO_BANK0_GPIO15_STATUS_OETOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO15_STATUS_OETOPAD_BITS, 0x00002000
.equ	IO_BANK0_GPIO15_STATUS_OETOPAD_MSB, 13
.equ	IO_BANK0_GPIO15_STATUS_OETOPAD_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO15_STATUS_OUTTOPAD
# Description : output signal to pad after register override is applied
.equ	IO_BANK0_GPIO15_STATUS_OUTTOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO15_STATUS_OUTTOPAD_BITS, 0x00000200
.equ	IO_BANK0_GPIO15_STATUS_OUTTOPAD_MSB, 9
.equ	IO_BANK0_GPIO15_STATUS_OUTTOPAD_LSB, 9
# =============================================================================
# Register    : IO_BANK0_GPIO15_CTRL
.equ	IO_BANK0_GPIO15_CTRL_OFFSET, 0x0000007c
.equ	IO_BANK0_GPIO15_CTRL_BITS, 0x3003f01f
.equ	IO_BANK0_GPIO15_CTRL_RESET, 0x0000001f
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO15_CTRL_IRQOVER
#               0x0 -> don't invert the interrupt
#               0x1 -> invert the interrupt
#               0x2 -> drive interrupt low
#               0x3 -> drive interrupt high
.equ	IO_BANK0_GPIO15_CTRL_IRQOVER_RESET, 0x0
.equ	IO_BANK0_GPIO15_CTRL_IRQOVER_BITS, 0x30000000
.equ	IO_BANK0_GPIO15_CTRL_IRQOVER_MSB, 29
.equ	IO_BANK0_GPIO15_CTRL_IRQOVER_LSB, 28
.equ	IO_BANK0_GPIO15_CTRL_IRQOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO15_CTRL_IRQOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO15_CTRL_IRQOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO15_CTRL_IRQOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO15_CTRL_INOVER
#               0x0 -> don't invert the peri input
#               0x1 -> invert the peri input
#               0x2 -> drive peri input low
#               0x3 -> drive peri input high
.equ	IO_BANK0_GPIO15_CTRL_INOVER_RESET, 0x0
.equ	IO_BANK0_GPIO15_CTRL_INOVER_BITS, 0x00030000
.equ	IO_BANK0_GPIO15_CTRL_INOVER_MSB, 17
.equ	IO_BANK0_GPIO15_CTRL_INOVER_LSB, 16
.equ	IO_BANK0_GPIO15_CTRL_INOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO15_CTRL_INOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO15_CTRL_INOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO15_CTRL_INOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO15_CTRL_OEOVER
#               0x0 -> drive output enable from peripheral signal selected by funcsel
#               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
#               0x2 -> disable output
#               0x3 -> enable output
.equ	IO_BANK0_GPIO15_CTRL_OEOVER_RESET, 0x0
.equ	IO_BANK0_GPIO15_CTRL_OEOVER_BITS, 0x0000c000
.equ	IO_BANK0_GPIO15_CTRL_OEOVER_MSB, 15
.equ	IO_BANK0_GPIO15_CTRL_OEOVER_LSB, 14
.equ	IO_BANK0_GPIO15_CTRL_OEOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO15_CTRL_OEOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO15_CTRL_OEOVER_VALUE_DISABLE, 0x2
.equ	IO_BANK0_GPIO15_CTRL_OEOVER_VALUE_ENABLE, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO15_CTRL_OUTOVER
#               0x0 -> drive output from peripheral signal selected by funcsel
#               0x1 -> drive output from inverse of peripheral signal selected by funcsel
#               0x2 -> drive output low
#               0x3 -> drive output high
.equ	IO_BANK0_GPIO15_CTRL_OUTOVER_RESET, 0x0
.equ	IO_BANK0_GPIO15_CTRL_OUTOVER_BITS, 0x00003000
.equ	IO_BANK0_GPIO15_CTRL_OUTOVER_MSB, 13
.equ	IO_BANK0_GPIO15_CTRL_OUTOVER_LSB, 12
.equ	IO_BANK0_GPIO15_CTRL_OUTOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO15_CTRL_OUTOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO15_CTRL_OUTOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO15_CTRL_OUTOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO15_CTRL_FUNCSEL
# Description : 0-31 -> selects pin function according to the gpio table
#               31 == NULL
#               0x00 -> hstx_3
#               0x01 -> spi1_tx
#               0x02 -> uart0_rts
#               0x03 -> i2c1_scl
#               0x04 -> pwm_b_7
#               0x05 -> siob_proc_15
#               0x06 -> pio0_15
#               0x07 -> pio1_15
#               0x08 -> pio2_15
#               0x09 -> clocks_gpout_1
#               0x0a -> usb_muxing_overcurr_detect
#               0x0b -> uart0_rx
#               0x1f -> null
.equ	IO_BANK0_GPIO15_CTRL_FUNCSEL_RESET, 0x1f
.equ	IO_BANK0_GPIO15_CTRL_FUNCSEL_BITS, 0x0000001f
.equ	IO_BANK0_GPIO15_CTRL_FUNCSEL_MSB, 4
.equ	IO_BANK0_GPIO15_CTRL_FUNCSEL_LSB, 0
.equ	IO_BANK0_GPIO15_CTRL_FUNCSEL_VALUE_HSTX_3, 0x00
.equ	IO_BANK0_GPIO15_CTRL_FUNCSEL_VALUE_SPI1_TX, 0x01
.equ	IO_BANK0_GPIO15_CTRL_FUNCSEL_VALUE_UART0_RTS, 0x02
.equ	IO_BANK0_GPIO15_CTRL_FUNCSEL_VALUE_I2C1_SCL, 0x03
.equ	IO_BANK0_GPIO15_CTRL_FUNCSEL_VALUE_PWM_B_7, 0x04
.equ	IO_BANK0_GPIO15_CTRL_FUNCSEL_VALUE_SIOB_PROC_15, 0x05
.equ	IO_BANK0_GPIO15_CTRL_FUNCSEL_VALUE_PIO0_15, 0x06
.equ	IO_BANK0_GPIO15_CTRL_FUNCSEL_VALUE_PIO1_15, 0x07
.equ	IO_BANK0_GPIO15_CTRL_FUNCSEL_VALUE_PIO2_15, 0x08
.equ	IO_BANK0_GPIO15_CTRL_FUNCSEL_VALUE_CLOCKS_GPOUT_1, 0x09
.equ	IO_BANK0_GPIO15_CTRL_FUNCSEL_VALUE_USB_MUXING_OVERCURR_DETECT, 0x0a
.equ	IO_BANK0_GPIO15_CTRL_FUNCSEL_VALUE_UART0_RX, 0x0b
.equ	IO_BANK0_GPIO15_CTRL_FUNCSEL_VALUE_NULL, 0x1f
# =============================================================================
# Register    : IO_BANK0_GPIO16_STATUS
.equ	IO_BANK0_GPIO16_STATUS_OFFSET, 0x00000080
.equ	IO_BANK0_GPIO16_STATUS_BITS, 0x04022200
.equ	IO_BANK0_GPIO16_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO16_STATUS_IRQTOPROC
# Description : interrupt to processors, after override is applied
.equ	IO_BANK0_GPIO16_STATUS_IRQTOPROC_RESET, 0x0
.equ	IO_BANK0_GPIO16_STATUS_IRQTOPROC_BITS, 0x04000000
.equ	IO_BANK0_GPIO16_STATUS_IRQTOPROC_MSB, 26
.equ	IO_BANK0_GPIO16_STATUS_IRQTOPROC_LSB, 26
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO16_STATUS_INFROMPAD
# Description : input signal from pad, before filtering and override are
#               applied
.equ	IO_BANK0_GPIO16_STATUS_INFROMPAD_RESET, 0x0
.equ	IO_BANK0_GPIO16_STATUS_INFROMPAD_BITS, 0x00020000
.equ	IO_BANK0_GPIO16_STATUS_INFROMPAD_MSB, 17
.equ	IO_BANK0_GPIO16_STATUS_INFROMPAD_LSB, 17
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO16_STATUS_OETOPAD
# Description : output enable to pad after register override is applied
.equ	IO_BANK0_GPIO16_STATUS_OETOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO16_STATUS_OETOPAD_BITS, 0x00002000
.equ	IO_BANK0_GPIO16_STATUS_OETOPAD_MSB, 13
.equ	IO_BANK0_GPIO16_STATUS_OETOPAD_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO16_STATUS_OUTTOPAD
# Description : output signal to pad after register override is applied
.equ	IO_BANK0_GPIO16_STATUS_OUTTOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO16_STATUS_OUTTOPAD_BITS, 0x00000200
.equ	IO_BANK0_GPIO16_STATUS_OUTTOPAD_MSB, 9
.equ	IO_BANK0_GPIO16_STATUS_OUTTOPAD_LSB, 9
# =============================================================================
# Register    : IO_BANK0_GPIO16_CTRL
.equ	IO_BANK0_GPIO16_CTRL_OFFSET, 0x00000084
.equ	IO_BANK0_GPIO16_CTRL_BITS, 0x3003f01f
.equ	IO_BANK0_GPIO16_CTRL_RESET, 0x0000001f
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO16_CTRL_IRQOVER
#               0x0 -> don't invert the interrupt
#               0x1 -> invert the interrupt
#               0x2 -> drive interrupt low
#               0x3 -> drive interrupt high
.equ	IO_BANK0_GPIO16_CTRL_IRQOVER_RESET, 0x0
.equ	IO_BANK0_GPIO16_CTRL_IRQOVER_BITS, 0x30000000
.equ	IO_BANK0_GPIO16_CTRL_IRQOVER_MSB, 29
.equ	IO_BANK0_GPIO16_CTRL_IRQOVER_LSB, 28
.equ	IO_BANK0_GPIO16_CTRL_IRQOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO16_CTRL_IRQOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO16_CTRL_IRQOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO16_CTRL_IRQOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO16_CTRL_INOVER
#               0x0 -> don't invert the peri input
#               0x1 -> invert the peri input
#               0x2 -> drive peri input low
#               0x3 -> drive peri input high
.equ	IO_BANK0_GPIO16_CTRL_INOVER_RESET, 0x0
.equ	IO_BANK0_GPIO16_CTRL_INOVER_BITS, 0x00030000
.equ	IO_BANK0_GPIO16_CTRL_INOVER_MSB, 17
.equ	IO_BANK0_GPIO16_CTRL_INOVER_LSB, 16
.equ	IO_BANK0_GPIO16_CTRL_INOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO16_CTRL_INOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO16_CTRL_INOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO16_CTRL_INOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO16_CTRL_OEOVER
#               0x0 -> drive output enable from peripheral signal selected by funcsel
#               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
#               0x2 -> disable output
#               0x3 -> enable output
.equ	IO_BANK0_GPIO16_CTRL_OEOVER_RESET, 0x0
.equ	IO_BANK0_GPIO16_CTRL_OEOVER_BITS, 0x0000c000
.equ	IO_BANK0_GPIO16_CTRL_OEOVER_MSB, 15
.equ	IO_BANK0_GPIO16_CTRL_OEOVER_LSB, 14
.equ	IO_BANK0_GPIO16_CTRL_OEOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO16_CTRL_OEOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO16_CTRL_OEOVER_VALUE_DISABLE, 0x2
.equ	IO_BANK0_GPIO16_CTRL_OEOVER_VALUE_ENABLE, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO16_CTRL_OUTOVER
#               0x0 -> drive output from peripheral signal selected by funcsel
#               0x1 -> drive output from inverse of peripheral signal selected by funcsel
#               0x2 -> drive output low
#               0x3 -> drive output high
.equ	IO_BANK0_GPIO16_CTRL_OUTOVER_RESET, 0x0
.equ	IO_BANK0_GPIO16_CTRL_OUTOVER_BITS, 0x00003000
.equ	IO_BANK0_GPIO16_CTRL_OUTOVER_MSB, 13
.equ	IO_BANK0_GPIO16_CTRL_OUTOVER_LSB, 12
.equ	IO_BANK0_GPIO16_CTRL_OUTOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO16_CTRL_OUTOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO16_CTRL_OUTOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO16_CTRL_OUTOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO16_CTRL_FUNCSEL
# Description : 0-31 -> selects pin function according to the gpio table
#               31 == NULL
#               0x00 -> hstx_4
#               0x01 -> spi0_rx
#               0x02 -> uart0_tx
#               0x03 -> i2c0_sda
#               0x04 -> pwm_a_0
#               0x05 -> siob_proc_16
#               0x06 -> pio0_16
#               0x07 -> pio1_16
#               0x08 -> pio2_16
#               0x0a -> usb_muxing_vbus_detect
#               0x1f -> null
.equ	IO_BANK0_GPIO16_CTRL_FUNCSEL_RESET, 0x1f
.equ	IO_BANK0_GPIO16_CTRL_FUNCSEL_BITS, 0x0000001f
.equ	IO_BANK0_GPIO16_CTRL_FUNCSEL_MSB, 4
.equ	IO_BANK0_GPIO16_CTRL_FUNCSEL_LSB, 0
.equ	IO_BANK0_GPIO16_CTRL_FUNCSEL_VALUE_HSTX_4, 0x00
.equ	IO_BANK0_GPIO16_CTRL_FUNCSEL_VALUE_SPI0_RX, 0x01
.equ	IO_BANK0_GPIO16_CTRL_FUNCSEL_VALUE_UART0_TX, 0x02
.equ	IO_BANK0_GPIO16_CTRL_FUNCSEL_VALUE_I2C0_SDA, 0x03
.equ	IO_BANK0_GPIO16_CTRL_FUNCSEL_VALUE_PWM_A_0, 0x04
.equ	IO_BANK0_GPIO16_CTRL_FUNCSEL_VALUE_SIOB_PROC_16, 0x05
.equ	IO_BANK0_GPIO16_CTRL_FUNCSEL_VALUE_PIO0_16, 0x06
.equ	IO_BANK0_GPIO16_CTRL_FUNCSEL_VALUE_PIO1_16, 0x07
.equ	IO_BANK0_GPIO16_CTRL_FUNCSEL_VALUE_PIO2_16, 0x08
.equ	IO_BANK0_GPIO16_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_DETECT, 0x0a
.equ	IO_BANK0_GPIO16_CTRL_FUNCSEL_VALUE_NULL, 0x1f
# =============================================================================
# Register    : IO_BANK0_GPIO17_STATUS
.equ	IO_BANK0_GPIO17_STATUS_OFFSET, 0x00000088
.equ	IO_BANK0_GPIO17_STATUS_BITS, 0x04022200
.equ	IO_BANK0_GPIO17_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO17_STATUS_IRQTOPROC
# Description : interrupt to processors, after override is applied
.equ	IO_BANK0_GPIO17_STATUS_IRQTOPROC_RESET, 0x0
.equ	IO_BANK0_GPIO17_STATUS_IRQTOPROC_BITS, 0x04000000
.equ	IO_BANK0_GPIO17_STATUS_IRQTOPROC_MSB, 26
.equ	IO_BANK0_GPIO17_STATUS_IRQTOPROC_LSB, 26
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO17_STATUS_INFROMPAD
# Description : input signal from pad, before filtering and override are
#               applied
.equ	IO_BANK0_GPIO17_STATUS_INFROMPAD_RESET, 0x0
.equ	IO_BANK0_GPIO17_STATUS_INFROMPAD_BITS, 0x00020000
.equ	IO_BANK0_GPIO17_STATUS_INFROMPAD_MSB, 17
.equ	IO_BANK0_GPIO17_STATUS_INFROMPAD_LSB, 17
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO17_STATUS_OETOPAD
# Description : output enable to pad after register override is applied
.equ	IO_BANK0_GPIO17_STATUS_OETOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO17_STATUS_OETOPAD_BITS, 0x00002000
.equ	IO_BANK0_GPIO17_STATUS_OETOPAD_MSB, 13
.equ	IO_BANK0_GPIO17_STATUS_OETOPAD_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO17_STATUS_OUTTOPAD
# Description : output signal to pad after register override is applied
.equ	IO_BANK0_GPIO17_STATUS_OUTTOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO17_STATUS_OUTTOPAD_BITS, 0x00000200
.equ	IO_BANK0_GPIO17_STATUS_OUTTOPAD_MSB, 9
.equ	IO_BANK0_GPIO17_STATUS_OUTTOPAD_LSB, 9
# =============================================================================
# Register    : IO_BANK0_GPIO17_CTRL
.equ	IO_BANK0_GPIO17_CTRL_OFFSET, 0x0000008c
.equ	IO_BANK0_GPIO17_CTRL_BITS, 0x3003f01f
.equ	IO_BANK0_GPIO17_CTRL_RESET, 0x0000001f
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO17_CTRL_IRQOVER
#               0x0 -> don't invert the interrupt
#               0x1 -> invert the interrupt
#               0x2 -> drive interrupt low
#               0x3 -> drive interrupt high
.equ	IO_BANK0_GPIO17_CTRL_IRQOVER_RESET, 0x0
.equ	IO_BANK0_GPIO17_CTRL_IRQOVER_BITS, 0x30000000
.equ	IO_BANK0_GPIO17_CTRL_IRQOVER_MSB, 29
.equ	IO_BANK0_GPIO17_CTRL_IRQOVER_LSB, 28
.equ	IO_BANK0_GPIO17_CTRL_IRQOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO17_CTRL_IRQOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO17_CTRL_IRQOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO17_CTRL_IRQOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO17_CTRL_INOVER
#               0x0 -> don't invert the peri input
#               0x1 -> invert the peri input
#               0x2 -> drive peri input low
#               0x3 -> drive peri input high
.equ	IO_BANK0_GPIO17_CTRL_INOVER_RESET, 0x0
.equ	IO_BANK0_GPIO17_CTRL_INOVER_BITS, 0x00030000
.equ	IO_BANK0_GPIO17_CTRL_INOVER_MSB, 17
.equ	IO_BANK0_GPIO17_CTRL_INOVER_LSB, 16
.equ	IO_BANK0_GPIO17_CTRL_INOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO17_CTRL_INOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO17_CTRL_INOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO17_CTRL_INOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO17_CTRL_OEOVER
#               0x0 -> drive output enable from peripheral signal selected by funcsel
#               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
#               0x2 -> disable output
#               0x3 -> enable output
.equ	IO_BANK0_GPIO17_CTRL_OEOVER_RESET, 0x0
.equ	IO_BANK0_GPIO17_CTRL_OEOVER_BITS, 0x0000c000
.equ	IO_BANK0_GPIO17_CTRL_OEOVER_MSB, 15
.equ	IO_BANK0_GPIO17_CTRL_OEOVER_LSB, 14
.equ	IO_BANK0_GPIO17_CTRL_OEOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO17_CTRL_OEOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO17_CTRL_OEOVER_VALUE_DISABLE, 0x2
.equ	IO_BANK0_GPIO17_CTRL_OEOVER_VALUE_ENABLE, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO17_CTRL_OUTOVER
#               0x0 -> drive output from peripheral signal selected by funcsel
#               0x1 -> drive output from inverse of peripheral signal selected by funcsel
#               0x2 -> drive output low
#               0x3 -> drive output high
.equ	IO_BANK0_GPIO17_CTRL_OUTOVER_RESET, 0x0
.equ	IO_BANK0_GPIO17_CTRL_OUTOVER_BITS, 0x00003000
.equ	IO_BANK0_GPIO17_CTRL_OUTOVER_MSB, 13
.equ	IO_BANK0_GPIO17_CTRL_OUTOVER_LSB, 12
.equ	IO_BANK0_GPIO17_CTRL_OUTOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO17_CTRL_OUTOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO17_CTRL_OUTOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO17_CTRL_OUTOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO17_CTRL_FUNCSEL
# Description : 0-31 -> selects pin function according to the gpio table
#               31 == NULL
#               0x00 -> hstx_5
#               0x01 -> spi0_ss_n
#               0x02 -> uart0_rx
#               0x03 -> i2c0_scl
#               0x04 -> pwm_b_0
#               0x05 -> siob_proc_17
#               0x06 -> pio0_17
#               0x07 -> pio1_17
#               0x08 -> pio2_17
#               0x0a -> usb_muxing_vbus_en
#               0x1f -> null
.equ	IO_BANK0_GPIO17_CTRL_FUNCSEL_RESET, 0x1f
.equ	IO_BANK0_GPIO17_CTRL_FUNCSEL_BITS, 0x0000001f
.equ	IO_BANK0_GPIO17_CTRL_FUNCSEL_MSB, 4
.equ	IO_BANK0_GPIO17_CTRL_FUNCSEL_LSB, 0
.equ	IO_BANK0_GPIO17_CTRL_FUNCSEL_VALUE_HSTX_5, 0x00
.equ	IO_BANK0_GPIO17_CTRL_FUNCSEL_VALUE_SPI0_SS_N, 0x01
.equ	IO_BANK0_GPIO17_CTRL_FUNCSEL_VALUE_UART0_RX, 0x02
.equ	IO_BANK0_GPIO17_CTRL_FUNCSEL_VALUE_I2C0_SCL, 0x03
.equ	IO_BANK0_GPIO17_CTRL_FUNCSEL_VALUE_PWM_B_0, 0x04
.equ	IO_BANK0_GPIO17_CTRL_FUNCSEL_VALUE_SIOB_PROC_17, 0x05
.equ	IO_BANK0_GPIO17_CTRL_FUNCSEL_VALUE_PIO0_17, 0x06
.equ	IO_BANK0_GPIO17_CTRL_FUNCSEL_VALUE_PIO1_17, 0x07
.equ	IO_BANK0_GPIO17_CTRL_FUNCSEL_VALUE_PIO2_17, 0x08
.equ	IO_BANK0_GPIO17_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_EN, 0x0a
.equ	IO_BANK0_GPIO17_CTRL_FUNCSEL_VALUE_NULL, 0x1f
# =============================================================================
# Register    : IO_BANK0_GPIO18_STATUS
.equ	IO_BANK0_GPIO18_STATUS_OFFSET, 0x00000090
.equ	IO_BANK0_GPIO18_STATUS_BITS, 0x04022200
.equ	IO_BANK0_GPIO18_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO18_STATUS_IRQTOPROC
# Description : interrupt to processors, after override is applied
.equ	IO_BANK0_GPIO18_STATUS_IRQTOPROC_RESET, 0x0
.equ	IO_BANK0_GPIO18_STATUS_IRQTOPROC_BITS, 0x04000000
.equ	IO_BANK0_GPIO18_STATUS_IRQTOPROC_MSB, 26
.equ	IO_BANK0_GPIO18_STATUS_IRQTOPROC_LSB, 26
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO18_STATUS_INFROMPAD
# Description : input signal from pad, before filtering and override are
#               applied
.equ	IO_BANK0_GPIO18_STATUS_INFROMPAD_RESET, 0x0
.equ	IO_BANK0_GPIO18_STATUS_INFROMPAD_BITS, 0x00020000
.equ	IO_BANK0_GPIO18_STATUS_INFROMPAD_MSB, 17
.equ	IO_BANK0_GPIO18_STATUS_INFROMPAD_LSB, 17
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO18_STATUS_OETOPAD
# Description : output enable to pad after register override is applied
.equ	IO_BANK0_GPIO18_STATUS_OETOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO18_STATUS_OETOPAD_BITS, 0x00002000
.equ	IO_BANK0_GPIO18_STATUS_OETOPAD_MSB, 13
.equ	IO_BANK0_GPIO18_STATUS_OETOPAD_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO18_STATUS_OUTTOPAD
# Description : output signal to pad after register override is applied
.equ	IO_BANK0_GPIO18_STATUS_OUTTOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO18_STATUS_OUTTOPAD_BITS, 0x00000200
.equ	IO_BANK0_GPIO18_STATUS_OUTTOPAD_MSB, 9
.equ	IO_BANK0_GPIO18_STATUS_OUTTOPAD_LSB, 9
# =============================================================================
# Register    : IO_BANK0_GPIO18_CTRL
.equ	IO_BANK0_GPIO18_CTRL_OFFSET, 0x00000094
.equ	IO_BANK0_GPIO18_CTRL_BITS, 0x3003f01f
.equ	IO_BANK0_GPIO18_CTRL_RESET, 0x0000001f
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO18_CTRL_IRQOVER
#               0x0 -> don't invert the interrupt
#               0x1 -> invert the interrupt
#               0x2 -> drive interrupt low
#               0x3 -> drive interrupt high
.equ	IO_BANK0_GPIO18_CTRL_IRQOVER_RESET, 0x0
.equ	IO_BANK0_GPIO18_CTRL_IRQOVER_BITS, 0x30000000
.equ	IO_BANK0_GPIO18_CTRL_IRQOVER_MSB, 29
.equ	IO_BANK0_GPIO18_CTRL_IRQOVER_LSB, 28
.equ	IO_BANK0_GPIO18_CTRL_IRQOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO18_CTRL_IRQOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO18_CTRL_IRQOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO18_CTRL_IRQOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO18_CTRL_INOVER
#               0x0 -> don't invert the peri input
#               0x1 -> invert the peri input
#               0x2 -> drive peri input low
#               0x3 -> drive peri input high
.equ	IO_BANK0_GPIO18_CTRL_INOVER_RESET, 0x0
.equ	IO_BANK0_GPIO18_CTRL_INOVER_BITS, 0x00030000
.equ	IO_BANK0_GPIO18_CTRL_INOVER_MSB, 17
.equ	IO_BANK0_GPIO18_CTRL_INOVER_LSB, 16
.equ	IO_BANK0_GPIO18_CTRL_INOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO18_CTRL_INOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO18_CTRL_INOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO18_CTRL_INOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO18_CTRL_OEOVER
#               0x0 -> drive output enable from peripheral signal selected by funcsel
#               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
#               0x2 -> disable output
#               0x3 -> enable output
.equ	IO_BANK0_GPIO18_CTRL_OEOVER_RESET, 0x0
.equ	IO_BANK0_GPIO18_CTRL_OEOVER_BITS, 0x0000c000
.equ	IO_BANK0_GPIO18_CTRL_OEOVER_MSB, 15
.equ	IO_BANK0_GPIO18_CTRL_OEOVER_LSB, 14
.equ	IO_BANK0_GPIO18_CTRL_OEOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO18_CTRL_OEOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO18_CTRL_OEOVER_VALUE_DISABLE, 0x2
