konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/io_bank0.inc
#               0x2 -> drive interrupt low
#               0x3 -> drive interrupt high
.equ	IO_BANK0_GPIO22_CTRL_IRQOVER_RESET, 0x0
.equ	IO_BANK0_GPIO22_CTRL_IRQOVER_BITS, 0x30000000
.equ	IO_BANK0_GPIO22_CTRL_IRQOVER_MSB, 29
.equ	IO_BANK0_GPIO22_CTRL_IRQOVER_LSB, 28
.equ	IO_BANK0_GPIO22_CTRL_IRQOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO22_CTRL_IRQOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO22_CTRL_IRQOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO22_CTRL_IRQOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO22_CTRL_INOVER
#               0x0 -> don't invert the peri input
#               0x1 -> invert the peri input
#               0x2 -> drive peri input low
#               0x3 -> drive peri input high
.equ	IO_BANK0_GPIO22_CTRL_INOVER_RESET, 0x0
.equ	IO_BANK0_GPIO22_CTRL_INOVER_BITS, 0x00030000
.equ	IO_BANK0_GPIO22_CTRL_INOVER_MSB, 17
.equ	IO_BANK0_GPIO22_CTRL_INOVER_LSB, 16
.equ	IO_BANK0_GPIO22_CTRL_INOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO22_CTRL_INOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO22_CTRL_INOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO22_CTRL_INOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO22_CTRL_OEOVER
#               0x0 -> drive output enable from peripheral signal selected by funcsel
#               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
#               0x2 -> disable output
#               0x3 -> enable output
.equ	IO_BANK0_GPIO22_CTRL_OEOVER_RESET, 0x0
.equ	IO_BANK0_GPIO22_CTRL_OEOVER_BITS, 0x0000c000
.equ	IO_BANK0_GPIO22_CTRL_OEOVER_MSB, 15
.equ	IO_BANK0_GPIO22_CTRL_OEOVER_LSB, 14
.equ	IO_BANK0_GPIO22_CTRL_OEOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO22_CTRL_OEOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO22_CTRL_OEOVER_VALUE_DISABLE, 0x2
.equ	IO_BANK0_GPIO22_CTRL_OEOVER_VALUE_ENABLE, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO22_CTRL_OUTOVER
#               0x0 -> drive output from peripheral signal selected by funcsel
#               0x1 -> drive output from inverse of peripheral signal selected by funcsel
#               0x2 -> drive output low
#               0x3 -> drive output high
.equ	IO_BANK0_GPIO22_CTRL_OUTOVER_RESET, 0x0
.equ	IO_BANK0_GPIO22_CTRL_OUTOVER_BITS, 0x00003000
.equ	IO_BANK0_GPIO22_CTRL_OUTOVER_MSB, 13
.equ	IO_BANK0_GPIO22_CTRL_OUTOVER_LSB, 12
.equ	IO_BANK0_GPIO22_CTRL_OUTOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO22_CTRL_OUTOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO22_CTRL_OUTOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO22_CTRL_OUTOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO22_CTRL_FUNCSEL
# Description : 0-31 -> selects pin function according to the gpio table
#               31 == NULL
#               0x01 -> spi0_sclk
#               0x02 -> uart1_cts
#               0x03 -> i2c1_sda
#               0x04 -> pwm_a_3
#               0x05 -> siob_proc_22
#               0x06 -> pio0_22
#               0x07 -> pio1_22
#               0x08 -> pio2_22
#               0x09 -> clocks_gpin_1
#               0x0a -> usb_muxing_vbus_detect
#               0x0b -> uart1_tx
#               0x1f -> null
.equ	IO_BANK0_GPIO22_CTRL_FUNCSEL_RESET, 0x1f
.equ	IO_BANK0_GPIO22_CTRL_FUNCSEL_BITS, 0x0000001f
.equ	IO_BANK0_GPIO22_CTRL_FUNCSEL_MSB, 4
.equ	IO_BANK0_GPIO22_CTRL_FUNCSEL_LSB, 0
.equ	IO_BANK0_GPIO22_CTRL_FUNCSEL_VALUE_SPI0_SCLK, 0x01
.equ	IO_BANK0_GPIO22_CTRL_FUNCSEL_VALUE_UART1_CTS, 0x02
.equ	IO_BANK0_GPIO22_CTRL_FUNCSEL_VALUE_I2C1_SDA, 0x03
.equ	IO_BANK0_GPIO22_CTRL_FUNCSEL_VALUE_PWM_A_3, 0x04
.equ	IO_BANK0_GPIO22_CTRL_FUNCSEL_VALUE_SIOB_PROC_22, 0x05
.equ	IO_BANK0_GPIO22_CTRL_FUNCSEL_VALUE_PIO0_22, 0x06
.equ	IO_BANK0_GPIO22_CTRL_FUNCSEL_VALUE_PIO1_22, 0x07
.equ	IO_BANK0_GPIO22_CTRL_FUNCSEL_VALUE_PIO2_22, 0x08
.equ	IO_BANK0_GPIO22_CTRL_FUNCSEL_VALUE_CLOCKS_GPIN_1, 0x09
.equ	IO_BANK0_GPIO22_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_DETECT, 0x0a
.equ	IO_BANK0_GPIO22_CTRL_FUNCSEL_VALUE_UART1_TX, 0x0b
.equ	IO_BANK0_GPIO22_CTRL_FUNCSEL_VALUE_NULL, 0x1f
# =============================================================================
# Register    : IO_BANK0_GPIO23_STATUS
.equ	IO_BANK0_GPIO23_STATUS_OFFSET, 0x000000b8
.equ	IO_BANK0_GPIO23_STATUS_BITS, 0x04022200
.equ	IO_BANK0_GPIO23_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO23_STATUS_IRQTOPROC
# Description : interrupt to processors, after override is applied
.equ	IO_BANK0_GPIO23_STATUS_IRQTOPROC_RESET, 0x0
.equ	IO_BANK0_GPIO23_STATUS_IRQTOPROC_BITS, 0x04000000
.equ	IO_BANK0_GPIO23_STATUS_IRQTOPROC_MSB, 26
.equ	IO_BANK0_GPIO23_STATUS_IRQTOPROC_LSB, 26
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO23_STATUS_INFROMPAD
# Description : input signal from pad, before filtering and override are
#               applied
.equ	IO_BANK0_GPIO23_STATUS_INFROMPAD_RESET, 0x0
.equ	IO_BANK0_GPIO23_STATUS_INFROMPAD_BITS, 0x00020000
.equ	IO_BANK0_GPIO23_STATUS_INFROMPAD_MSB, 17
.equ	IO_BANK0_GPIO23_STATUS_INFROMPAD_LSB, 17
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO23_STATUS_OETOPAD
# Description : output enable to pad after register override is applied
.equ	IO_BANK0_GPIO23_STATUS_OETOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO23_STATUS_OETOPAD_BITS, 0x00002000
.equ	IO_BANK0_GPIO23_STATUS_OETOPAD_MSB, 13
.equ	IO_BANK0_GPIO23_STATUS_OETOPAD_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO23_STATUS_OUTTOPAD
# Description : output signal to pad after register override is applied
.equ	IO_BANK0_GPIO23_STATUS_OUTTOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO23_STATUS_OUTTOPAD_BITS, 0x00000200
.equ	IO_BANK0_GPIO23_STATUS_OUTTOPAD_MSB, 9
.equ	IO_BANK0_GPIO23_STATUS_OUTTOPAD_LSB, 9
# =============================================================================
# Register    : IO_BANK0_GPIO23_CTRL
.equ	IO_BANK0_GPIO23_CTRL_OFFSET, 0x000000bc
.equ	IO_BANK0_GPIO23_CTRL_BITS, 0x3003f01f
.equ	IO_BANK0_GPIO23_CTRL_RESET, 0x0000001f
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO23_CTRL_IRQOVER
#               0x0 -> don't invert the interrupt
#               0x1 -> invert the interrupt
#               0x2 -> drive interrupt low
#               0x3 -> drive interrupt high
.equ	IO_BANK0_GPIO23_CTRL_IRQOVER_RESET, 0x0
.equ	IO_BANK0_GPIO23_CTRL_IRQOVER_BITS, 0x30000000
.equ	IO_BANK0_GPIO23_CTRL_IRQOVER_MSB, 29
.equ	IO_BANK0_GPIO23_CTRL_IRQOVER_LSB, 28
.equ	IO_BANK0_GPIO23_CTRL_IRQOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO23_CTRL_IRQOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO23_CTRL_IRQOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO23_CTRL_IRQOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO23_CTRL_INOVER
#               0x0 -> don't invert the peri input
#               0x1 -> invert the peri input
#               0x2 -> drive peri input low
#               0x3 -> drive peri input high
.equ	IO_BANK0_GPIO23_CTRL_INOVER_RESET, 0x0
.equ	IO_BANK0_GPIO23_CTRL_INOVER_BITS, 0x00030000
.equ	IO_BANK0_GPIO23_CTRL_INOVER_MSB, 17
.equ	IO_BANK0_GPIO23_CTRL_INOVER_LSB, 16
.equ	IO_BANK0_GPIO23_CTRL_INOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO23_CTRL_INOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO23_CTRL_INOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO23_CTRL_INOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO23_CTRL_OEOVER
#               0x0 -> drive output enable from peripheral signal selected by funcsel
#               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
#               0x2 -> disable output
#               0x3 -> enable output
.equ	IO_BANK0_GPIO23_CTRL_OEOVER_RESET, 0x0
.equ	IO_BANK0_GPIO23_CTRL_OEOVER_BITS, 0x0000c000
.equ	IO_BANK0_GPIO23_CTRL_OEOVER_MSB, 15
.equ	IO_BANK0_GPIO23_CTRL_OEOVER_LSB, 14
.equ	IO_BANK0_GPIO23_CTRL_OEOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO23_CTRL_OEOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO23_CTRL_OEOVER_VALUE_DISABLE, 0x2
.equ	IO_BANK0_GPIO23_CTRL_OEOVER_VALUE_ENABLE, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO23_CTRL_OUTOVER
#               0x0 -> drive output from peripheral signal selected by funcsel
#               0x1 -> drive output from inverse of peripheral signal selected by funcsel
#               0x2 -> drive output low
#               0x3 -> drive output high
.equ	IO_BANK0_GPIO23_CTRL_OUTOVER_RESET, 0x0
.equ	IO_BANK0_GPIO23_CTRL_OUTOVER_BITS, 0x00003000
.equ	IO_BANK0_GPIO23_CTRL_OUTOVER_MSB, 13
.equ	IO_BANK0_GPIO23_CTRL_OUTOVER_LSB, 12
.equ	IO_BANK0_GPIO23_CTRL_OUTOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO23_CTRL_OUTOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO23_CTRL_OUTOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO23_CTRL_OUTOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO23_CTRL_FUNCSEL
# Description : 0-31 -> selects pin function according to the gpio table
#               31 == NULL
#               0x01 -> spi0_tx
#               0x02 -> uart1_rts
#               0x03 -> i2c1_scl
#               0x04 -> pwm_b_3
#               0x05 -> siob_proc_23
#               0x06 -> pio0_23
#               0x07 -> pio1_23
#               0x08 -> pio2_23
#               0x09 -> clocks_gpout_1
#               0x0a -> usb_muxing_vbus_en
#               0x0b -> uart1_rx
#               0x1f -> null
.equ	IO_BANK0_GPIO23_CTRL_FUNCSEL_RESET, 0x1f
.equ	IO_BANK0_GPIO23_CTRL_FUNCSEL_BITS, 0x0000001f
.equ	IO_BANK0_GPIO23_CTRL_FUNCSEL_MSB, 4
.equ	IO_BANK0_GPIO23_CTRL_FUNCSEL_LSB, 0
.equ	IO_BANK0_GPIO23_CTRL_FUNCSEL_VALUE_SPI0_TX, 0x01
.equ	IO_BANK0_GPIO23_CTRL_FUNCSEL_VALUE_UART1_RTS, 0x02
.equ	IO_BANK0_GPIO23_CTRL_FUNCSEL_VALUE_I2C1_SCL, 0x03
.equ	IO_BANK0_GPIO23_CTRL_FUNCSEL_VALUE_PWM_B_3, 0x04
.equ	IO_BANK0_GPIO23_CTRL_FUNCSEL_VALUE_SIOB_PROC_23, 0x05
.equ	IO_BANK0_GPIO23_CTRL_FUNCSEL_VALUE_PIO0_23, 0x06
.equ	IO_BANK0_GPIO23_CTRL_FUNCSEL_VALUE_PIO1_23, 0x07
.equ	IO_BANK0_GPIO23_CTRL_FUNCSEL_VALUE_PIO2_23, 0x08
.equ	IO_BANK0_GPIO23_CTRL_FUNCSEL_VALUE_CLOCKS_GPOUT_1, 0x09
.equ	IO_BANK0_GPIO23_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_EN, 0x0a
.equ	IO_BANK0_GPIO23_CTRL_FUNCSEL_VALUE_UART1_RX, 0x0b
.equ	IO_BANK0_GPIO23_CTRL_FUNCSEL_VALUE_NULL, 0x1f
# =============================================================================
# Register    : IO_BANK0_GPIO24_STATUS
.equ	IO_BANK0_GPIO24_STATUS_OFFSET, 0x000000c0
.equ	IO_BANK0_GPIO24_STATUS_BITS, 0x04022200
.equ	IO_BANK0_GPIO24_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO24_STATUS_IRQTOPROC
# Description : interrupt to processors, after override is applied
.equ	IO_BANK0_GPIO24_STATUS_IRQTOPROC_RESET, 0x0
.equ	IO_BANK0_GPIO24_STATUS_IRQTOPROC_BITS, 0x04000000
.equ	IO_BANK0_GPIO24_STATUS_IRQTOPROC_MSB, 26
.equ	IO_BANK0_GPIO24_STATUS_IRQTOPROC_LSB, 26
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO24_STATUS_INFROMPAD
# Description : input signal from pad, before filtering and override are
#               applied
.equ	IO_BANK0_GPIO24_STATUS_INFROMPAD_RESET, 0x0
.equ	IO_BANK0_GPIO24_STATUS_INFROMPAD_BITS, 0x00020000
.equ	IO_BANK0_GPIO24_STATUS_INFROMPAD_MSB, 17
.equ	IO_BANK0_GPIO24_STATUS_INFROMPAD_LSB, 17
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO24_STATUS_OETOPAD
# Description : output enable to pad after register override is applied
.equ	IO_BANK0_GPIO24_STATUS_OETOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO24_STATUS_OETOPAD_BITS, 0x00002000
.equ	IO_BANK0_GPIO24_STATUS_OETOPAD_MSB, 13
.equ	IO_BANK0_GPIO24_STATUS_OETOPAD_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO24_STATUS_OUTTOPAD
# Description : output signal to pad after register override is applied
.equ	IO_BANK0_GPIO24_STATUS_OUTTOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO24_STATUS_OUTTOPAD_BITS, 0x00000200
.equ	IO_BANK0_GPIO24_STATUS_OUTTOPAD_MSB, 9
.equ	IO_BANK0_GPIO24_STATUS_OUTTOPAD_LSB, 9
# =============================================================================
# Register    : IO_BANK0_GPIO24_CTRL
.equ	IO_BANK0_GPIO24_CTRL_OFFSET, 0x000000c4
.equ	IO_BANK0_GPIO24_CTRL_BITS, 0x3003f01f
.equ	IO_BANK0_GPIO24_CTRL_RESET, 0x0000001f
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO24_CTRL_IRQOVER
#               0x0 -> don't invert the interrupt
#               0x1 -> invert the interrupt
#               0x2 -> drive interrupt low
#               0x3 -> drive interrupt high
.equ	IO_BANK0_GPIO24_CTRL_IRQOVER_RESET, 0x0
.equ	IO_BANK0_GPIO24_CTRL_IRQOVER_BITS, 0x30000000
.equ	IO_BANK0_GPIO24_CTRL_IRQOVER_MSB, 29
.equ	IO_BANK0_GPIO24_CTRL_IRQOVER_LSB, 28
.equ	IO_BANK0_GPIO24_CTRL_IRQOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO24_CTRL_IRQOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO24_CTRL_IRQOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO24_CTRL_IRQOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO24_CTRL_INOVER
#               0x0 -> don't invert the peri input
#               0x1 -> invert the peri input
#               0x2 -> drive peri input low
#               0x3 -> drive peri input high
.equ	IO_BANK0_GPIO24_CTRL_INOVER_RESET, 0x0
.equ	IO_BANK0_GPIO24_CTRL_INOVER_BITS, 0x00030000
.equ	IO_BANK0_GPIO24_CTRL_INOVER_MSB, 17
.equ	IO_BANK0_GPIO24_CTRL_INOVER_LSB, 16
.equ	IO_BANK0_GPIO24_CTRL_INOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO24_CTRL_INOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO24_CTRL_INOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO24_CTRL_INOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO24_CTRL_OEOVER
#               0x0 -> drive output enable from peripheral signal selected by funcsel
#               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
#               0x2 -> disable output
#               0x3 -> enable output
.equ	IO_BANK0_GPIO24_CTRL_OEOVER_RESET, 0x0
.equ	IO_BANK0_GPIO24_CTRL_OEOVER_BITS, 0x0000c000
.equ	IO_BANK0_GPIO24_CTRL_OEOVER_MSB, 15
.equ	IO_BANK0_GPIO24_CTRL_OEOVER_LSB, 14
.equ	IO_BANK0_GPIO24_CTRL_OEOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO24_CTRL_OEOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO24_CTRL_OEOVER_VALUE_DISABLE, 0x2
.equ	IO_BANK0_GPIO24_CTRL_OEOVER_VALUE_ENABLE, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO24_CTRL_OUTOVER
#               0x0 -> drive output from peripheral signal selected by funcsel
#               0x1 -> drive output from inverse of peripheral signal selected by funcsel
#               0x2 -> drive output low
#               0x3 -> drive output high
.equ	IO_BANK0_GPIO24_CTRL_OUTOVER_RESET, 0x0
.equ	IO_BANK0_GPIO24_CTRL_OUTOVER_BITS, 0x00003000
.equ	IO_BANK0_GPIO24_CTRL_OUTOVER_MSB, 13
.equ	IO_BANK0_GPIO24_CTRL_OUTOVER_LSB, 12
.equ	IO_BANK0_GPIO24_CTRL_OUTOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO24_CTRL_OUTOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO24_CTRL_OUTOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO24_CTRL_OUTOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO24_CTRL_FUNCSEL
# Description : 0-31 -> selects pin function according to the gpio table
#               31 == NULL
#               0x01 -> spi1_rx
#               0x02 -> uart1_tx
#               0x03 -> i2c0_sda
#               0x04 -> pwm_a_4
#               0x05 -> siob_proc_24
#               0x06 -> pio0_24
#               0x07 -> pio1_24
#               0x08 -> pio2_24
#               0x09 -> clocks_gpout_2
#               0x0a -> usb_muxing_overcurr_detect
#               0x1f -> null
.equ	IO_BANK0_GPIO24_CTRL_FUNCSEL_RESET, 0x1f
.equ	IO_BANK0_GPIO24_CTRL_FUNCSEL_BITS, 0x0000001f
.equ	IO_BANK0_GPIO24_CTRL_FUNCSEL_MSB, 4
.equ	IO_BANK0_GPIO24_CTRL_FUNCSEL_LSB, 0
.equ	IO_BANK0_GPIO24_CTRL_FUNCSEL_VALUE_SPI1_RX, 0x01
.equ	IO_BANK0_GPIO24_CTRL_FUNCSEL_VALUE_UART1_TX, 0x02
.equ	IO_BANK0_GPIO24_CTRL_FUNCSEL_VALUE_I2C0_SDA, 0x03
.equ	IO_BANK0_GPIO24_CTRL_FUNCSEL_VALUE_PWM_A_4, 0x04
.equ	IO_BANK0_GPIO24_CTRL_FUNCSEL_VALUE_SIOB_PROC_24, 0x05
.equ	IO_BANK0_GPIO24_CTRL_FUNCSEL_VALUE_PIO0_24, 0x06
.equ	IO_BANK0_GPIO24_CTRL_FUNCSEL_VALUE_PIO1_24, 0x07
.equ	IO_BANK0_GPIO24_CTRL_FUNCSEL_VALUE_PIO2_24, 0x08
.equ	IO_BANK0_GPIO24_CTRL_FUNCSEL_VALUE_CLOCKS_GPOUT_2, 0x09
.equ	IO_BANK0_GPIO24_CTRL_FUNCSEL_VALUE_USB_MUXING_OVERCURR_DETECT, 0x0a
.equ	IO_BANK0_GPIO24_CTRL_FUNCSEL_VALUE_NULL, 0x1f
# =============================================================================
# Register    : IO_BANK0_GPIO25_STATUS
.equ	IO_BANK0_GPIO25_STATUS_OFFSET, 0x000000c8
.equ	IO_BANK0_GPIO25_STATUS_BITS, 0x04022200
.equ	IO_BANK0_GPIO25_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO25_STATUS_IRQTOPROC
# Description : interrupt to processors, after override is applied
.equ	IO_BANK0_GPIO25_STATUS_IRQTOPROC_RESET, 0x0
.equ	IO_BANK0_GPIO25_STATUS_IRQTOPROC_BITS, 0x04000000
.equ	IO_BANK0_GPIO25_STATUS_IRQTOPROC_MSB, 26
.equ	IO_BANK0_GPIO25_STATUS_IRQTOPROC_LSB, 26
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO25_STATUS_INFROMPAD
# Description : input signal from pad, before filtering and override are
#               applied
.equ	IO_BANK0_GPIO25_STATUS_INFROMPAD_RESET, 0x0
.equ	IO_BANK0_GPIO25_STATUS_INFROMPAD_BITS, 0x00020000
.equ	IO_BANK0_GPIO25_STATUS_INFROMPAD_MSB, 17
.equ	IO_BANK0_GPIO25_STATUS_INFROMPAD_LSB, 17
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO25_STATUS_OETOPAD
# Description : output enable to pad after register override is applied
.equ	IO_BANK0_GPIO25_STATUS_OETOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO25_STATUS_OETOPAD_BITS, 0x00002000
.equ	IO_BANK0_GPIO25_STATUS_OETOPAD_MSB, 13
.equ	IO_BANK0_GPIO25_STATUS_OETOPAD_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO25_STATUS_OUTTOPAD
# Description : output signal to pad after register override is applied
.equ	IO_BANK0_GPIO25_STATUS_OUTTOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO25_STATUS_OUTTOPAD_BITS, 0x00000200
.equ	IO_BANK0_GPIO25_STATUS_OUTTOPAD_MSB, 9
.equ	IO_BANK0_GPIO25_STATUS_OUTTOPAD_LSB, 9
# =============================================================================
# Register    : IO_BANK0_GPIO25_CTRL
.equ	IO_BANK0_GPIO25_CTRL_OFFSET, 0x000000cc
.equ	IO_BANK0_GPIO25_CTRL_BITS, 0x3003f01f
.equ	IO_BANK0_GPIO25_CTRL_RESET, 0x0000001f
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO25_CTRL_IRQOVER
#               0x0 -> don't invert the interrupt
#               0x1 -> invert the interrupt
#               0x2 -> drive interrupt low
#               0x3 -> drive interrupt high
.equ	IO_BANK0_GPIO25_CTRL_IRQOVER_RESET, 0x0
.equ	IO_BANK0_GPIO25_CTRL_IRQOVER_BITS, 0x30000000
.equ	IO_BANK0_GPIO25_CTRL_IRQOVER_MSB, 29
.equ	IO_BANK0_GPIO25_CTRL_IRQOVER_LSB, 28
.equ	IO_BANK0_GPIO25_CTRL_IRQOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO25_CTRL_IRQOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO25_CTRL_IRQOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO25_CTRL_IRQOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO25_CTRL_INOVER
#               0x0 -> don't invert the peri input
#               0x1 -> invert the peri input
#               0x2 -> drive peri input low
#               0x3 -> drive peri input high
.equ	IO_BANK0_GPIO25_CTRL_INOVER_RESET, 0x0
.equ	IO_BANK0_GPIO25_CTRL_INOVER_BITS, 0x00030000
.equ	IO_BANK0_GPIO25_CTRL_INOVER_MSB, 17
.equ	IO_BANK0_GPIO25_CTRL_INOVER_LSB, 16
.equ	IO_BANK0_GPIO25_CTRL_INOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO25_CTRL_INOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO25_CTRL_INOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO25_CTRL_INOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO25_CTRL_OEOVER
#               0x0 -> drive output enable from peripheral signal selected by funcsel
#               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
#               0x2 -> disable output
#               0x3 -> enable output
.equ	IO_BANK0_GPIO25_CTRL_OEOVER_RESET, 0x0
.equ	IO_BANK0_GPIO25_CTRL_OEOVER_BITS, 0x0000c000
.equ	IO_BANK0_GPIO25_CTRL_OEOVER_MSB, 15
.equ	IO_BANK0_GPIO25_CTRL_OEOVER_LSB, 14
.equ	IO_BANK0_GPIO25_CTRL_OEOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO25_CTRL_OEOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO25_CTRL_OEOVER_VALUE_DISABLE, 0x2
.equ	IO_BANK0_GPIO25_CTRL_OEOVER_VALUE_ENABLE, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO25_CTRL_OUTOVER
#               0x0 -> drive output from peripheral signal selected by funcsel
#               0x1 -> drive output from inverse of peripheral signal selected by funcsel
#               0x2 -> drive output low
#               0x3 -> drive output high
.equ	IO_BANK0_GPIO25_CTRL_OUTOVER_RESET, 0x0
.equ	IO_BANK0_GPIO25_CTRL_OUTOVER_BITS, 0x00003000
.equ	IO_BANK0_GPIO25_CTRL_OUTOVER_MSB, 13
.equ	IO_BANK0_GPIO25_CTRL_OUTOVER_LSB, 12
.equ	IO_BANK0_GPIO25_CTRL_OUTOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO25_CTRL_OUTOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO25_CTRL_OUTOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO25_CTRL_OUTOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO25_CTRL_FUNCSEL
# Description : 0-31 -> selects pin function according to the gpio table
#               31 == NULL
#               0x01 -> spi1_ss_n
#               0x02 -> uart1_rx
#               0x03 -> i2c0_scl
#               0x04 -> pwm_b_4
#               0x05 -> siob_proc_25
#               0x06 -> pio0_25
#               0x07 -> pio1_25
#               0x08 -> pio2_25
#               0x09 -> clocks_gpout_3
#               0x0a -> usb_muxing_vbus_detect
#               0x1f -> null
.equ	IO_BANK0_GPIO25_CTRL_FUNCSEL_RESET, 0x1f
.equ	IO_BANK0_GPIO25_CTRL_FUNCSEL_BITS, 0x0000001f
.equ	IO_BANK0_GPIO25_CTRL_FUNCSEL_MSB, 4
.equ	IO_BANK0_GPIO25_CTRL_FUNCSEL_LSB, 0
.equ	IO_BANK0_GPIO25_CTRL_FUNCSEL_VALUE_SPI1_SS_N, 0x01
.equ	IO_BANK0_GPIO25_CTRL_FUNCSEL_VALUE_UART1_RX, 0x02
.equ	IO_BANK0_GPIO25_CTRL_FUNCSEL_VALUE_I2C0_SCL, 0x03
.equ	IO_BANK0_GPIO25_CTRL_FUNCSEL_VALUE_PWM_B_4, 0x04
.equ	IO_BANK0_GPIO25_CTRL_FUNCSEL_VALUE_SIOB_PROC_25, 0x05
.equ	IO_BANK0_GPIO25_CTRL_FUNCSEL_VALUE_PIO0_25, 0x06
.equ	IO_BANK0_GPIO25_CTRL_FUNCSEL_VALUE_PIO1_25, 0x07
.equ	IO_BANK0_GPIO25_CTRL_FUNCSEL_VALUE_PIO2_25, 0x08
.equ	IO_BANK0_GPIO25_CTRL_FUNCSEL_VALUE_CLOCKS_GPOUT_3, 0x09
.equ	IO_BANK0_GPIO25_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_DETECT, 0x0a
.equ	IO_BANK0_GPIO25_CTRL_FUNCSEL_VALUE_NULL, 0x1f
# =============================================================================
# Register    : IO_BANK0_GPIO26_STATUS
.equ	IO_BANK0_GPIO26_STATUS_OFFSET, 0x000000d0
.equ	IO_BANK0_GPIO26_STATUS_BITS, 0x04022200
.equ	IO_BANK0_GPIO26_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO26_STATUS_IRQTOPROC
# Description : interrupt to processors, after override is applied
.equ	IO_BANK0_GPIO26_STATUS_IRQTOPROC_RESET, 0x0
.equ	IO_BANK0_GPIO26_STATUS_IRQTOPROC_BITS, 0x04000000
