konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/io_bank0.inc
.equ	IO_BANK0_GPIO41_STATUS_OETOPAD_BITS, 0x00002000
.equ	IO_BANK0_GPIO41_STATUS_OETOPAD_MSB, 13
.equ	IO_BANK0_GPIO41_STATUS_OETOPAD_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO41_STATUS_OUTTOPAD
# Description : output signal to pad after register override is applied
.equ	IO_BANK0_GPIO41_STATUS_OUTTOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO41_STATUS_OUTTOPAD_BITS, 0x00000200
.equ	IO_BANK0_GPIO41_STATUS_OUTTOPAD_MSB, 9
.equ	IO_BANK0_GPIO41_STATUS_OUTTOPAD_LSB, 9
# =============================================================================
# Register    : IO_BANK0_GPIO41_CTRL
.equ	IO_BANK0_GPIO41_CTRL_OFFSET, 0x0000014c
.equ	IO_BANK0_GPIO41_CTRL_BITS, 0x3003f01f
.equ	IO_BANK0_GPIO41_CTRL_RESET, 0x0000001f
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO41_CTRL_IRQOVER
#               0x0 -> don't invert the interrupt
#               0x1 -> invert the interrupt
#               0x2 -> drive interrupt low
#               0x3 -> drive interrupt high
.equ	IO_BANK0_GPIO41_CTRL_IRQOVER_RESET, 0x0
.equ	IO_BANK0_GPIO41_CTRL_IRQOVER_BITS, 0x30000000
.equ	IO_BANK0_GPIO41_CTRL_IRQOVER_MSB, 29
.equ	IO_BANK0_GPIO41_CTRL_IRQOVER_LSB, 28
.equ	IO_BANK0_GPIO41_CTRL_IRQOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO41_CTRL_IRQOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO41_CTRL_IRQOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO41_CTRL_IRQOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO41_CTRL_INOVER
#               0x0 -> don't invert the peri input
#               0x1 -> invert the peri input
#               0x2 -> drive peri input low
#               0x3 -> drive peri input high
.equ	IO_BANK0_GPIO41_CTRL_INOVER_RESET, 0x0
.equ	IO_BANK0_GPIO41_CTRL_INOVER_BITS, 0x00030000
.equ	IO_BANK0_GPIO41_CTRL_INOVER_MSB, 17
.equ	IO_BANK0_GPIO41_CTRL_INOVER_LSB, 16
.equ	IO_BANK0_GPIO41_CTRL_INOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO41_CTRL_INOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO41_CTRL_INOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO41_CTRL_INOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO41_CTRL_OEOVER
#               0x0 -> drive output enable from peripheral signal selected by funcsel
#               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
#               0x2 -> disable output
#               0x3 -> enable output
.equ	IO_BANK0_GPIO41_CTRL_OEOVER_RESET, 0x0
.equ	IO_BANK0_GPIO41_CTRL_OEOVER_BITS, 0x0000c000
.equ	IO_BANK0_GPIO41_CTRL_OEOVER_MSB, 15
.equ	IO_BANK0_GPIO41_CTRL_OEOVER_LSB, 14
.equ	IO_BANK0_GPIO41_CTRL_OEOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO41_CTRL_OEOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO41_CTRL_OEOVER_VALUE_DISABLE, 0x2
.equ	IO_BANK0_GPIO41_CTRL_OEOVER_VALUE_ENABLE, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO41_CTRL_OUTOVER
#               0x0 -> drive output from peripheral signal selected by funcsel
#               0x1 -> drive output from inverse of peripheral signal selected by funcsel
#               0x2 -> drive output low
#               0x3 -> drive output high
.equ	IO_BANK0_GPIO41_CTRL_OUTOVER_RESET, 0x0
.equ	IO_BANK0_GPIO41_CTRL_OUTOVER_BITS, 0x00003000
.equ	IO_BANK0_GPIO41_CTRL_OUTOVER_MSB, 13
.equ	IO_BANK0_GPIO41_CTRL_OUTOVER_LSB, 12
.equ	IO_BANK0_GPIO41_CTRL_OUTOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO41_CTRL_OUTOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO41_CTRL_OUTOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO41_CTRL_OUTOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO41_CTRL_FUNCSEL
# Description : 0-31 -> selects pin function according to the gpio table
#               31 == NULL
#               0x01 -> spi1_ss_n
#               0x02 -> uart1_rx
#               0x03 -> i2c0_scl
#               0x04 -> pwm_b_8
#               0x05 -> siob_proc_41
#               0x06 -> pio0_41
#               0x07 -> pio1_41
#               0x08 -> pio2_41
#               0x0a -> usb_muxing_vbus_en
#               0x1f -> null
.equ	IO_BANK0_GPIO41_CTRL_FUNCSEL_RESET, 0x1f
.equ	IO_BANK0_GPIO41_CTRL_FUNCSEL_BITS, 0x0000001f
.equ	IO_BANK0_GPIO41_CTRL_FUNCSEL_MSB, 4
.equ	IO_BANK0_GPIO41_CTRL_FUNCSEL_LSB, 0
.equ	IO_BANK0_GPIO41_CTRL_FUNCSEL_VALUE_SPI1_SS_N, 0x01
.equ	IO_BANK0_GPIO41_CTRL_FUNCSEL_VALUE_UART1_RX, 0x02
.equ	IO_BANK0_GPIO41_CTRL_FUNCSEL_VALUE_I2C0_SCL, 0x03
.equ	IO_BANK0_GPIO41_CTRL_FUNCSEL_VALUE_PWM_B_8, 0x04
.equ	IO_BANK0_GPIO41_CTRL_FUNCSEL_VALUE_SIOB_PROC_41, 0x05
.equ	IO_BANK0_GPIO41_CTRL_FUNCSEL_VALUE_PIO0_41, 0x06
.equ	IO_BANK0_GPIO41_CTRL_FUNCSEL_VALUE_PIO1_41, 0x07
.equ	IO_BANK0_GPIO41_CTRL_FUNCSEL_VALUE_PIO2_41, 0x08
.equ	IO_BANK0_GPIO41_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_EN, 0x0a
.equ	IO_BANK0_GPIO41_CTRL_FUNCSEL_VALUE_NULL, 0x1f
# =============================================================================
# Register    : IO_BANK0_GPIO42_STATUS
.equ	IO_BANK0_GPIO42_STATUS_OFFSET, 0x00000150
.equ	IO_BANK0_GPIO42_STATUS_BITS, 0x04022200
.equ	IO_BANK0_GPIO42_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO42_STATUS_IRQTOPROC
# Description : interrupt to processors, after override is applied
.equ	IO_BANK0_GPIO42_STATUS_IRQTOPROC_RESET, 0x0
.equ	IO_BANK0_GPIO42_STATUS_IRQTOPROC_BITS, 0x04000000
.equ	IO_BANK0_GPIO42_STATUS_IRQTOPROC_MSB, 26
.equ	IO_BANK0_GPIO42_STATUS_IRQTOPROC_LSB, 26
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO42_STATUS_INFROMPAD
# Description : input signal from pad, before filtering and override are
#               applied
.equ	IO_BANK0_GPIO42_STATUS_INFROMPAD_RESET, 0x0
.equ	IO_BANK0_GPIO42_STATUS_INFROMPAD_BITS, 0x00020000
.equ	IO_BANK0_GPIO42_STATUS_INFROMPAD_MSB, 17
.equ	IO_BANK0_GPIO42_STATUS_INFROMPAD_LSB, 17
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO42_STATUS_OETOPAD
# Description : output enable to pad after register override is applied
.equ	IO_BANK0_GPIO42_STATUS_OETOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO42_STATUS_OETOPAD_BITS, 0x00002000
.equ	IO_BANK0_GPIO42_STATUS_OETOPAD_MSB, 13
.equ	IO_BANK0_GPIO42_STATUS_OETOPAD_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO42_STATUS_OUTTOPAD
# Description : output signal to pad after register override is applied
.equ	IO_BANK0_GPIO42_STATUS_OUTTOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO42_STATUS_OUTTOPAD_BITS, 0x00000200
.equ	IO_BANK0_GPIO42_STATUS_OUTTOPAD_MSB, 9
.equ	IO_BANK0_GPIO42_STATUS_OUTTOPAD_LSB, 9
# =============================================================================
# Register    : IO_BANK0_GPIO42_CTRL
.equ	IO_BANK0_GPIO42_CTRL_OFFSET, 0x00000154
.equ	IO_BANK0_GPIO42_CTRL_BITS, 0x3003f01f
.equ	IO_BANK0_GPIO42_CTRL_RESET, 0x0000001f
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO42_CTRL_IRQOVER
#               0x0 -> don't invert the interrupt
#               0x1 -> invert the interrupt
#               0x2 -> drive interrupt low
#               0x3 -> drive interrupt high
.equ	IO_BANK0_GPIO42_CTRL_IRQOVER_RESET, 0x0
.equ	IO_BANK0_GPIO42_CTRL_IRQOVER_BITS, 0x30000000
.equ	IO_BANK0_GPIO42_CTRL_IRQOVER_MSB, 29
.equ	IO_BANK0_GPIO42_CTRL_IRQOVER_LSB, 28
.equ	IO_BANK0_GPIO42_CTRL_IRQOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO42_CTRL_IRQOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO42_CTRL_IRQOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO42_CTRL_IRQOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO42_CTRL_INOVER
#               0x0 -> don't invert the peri input
#               0x1 -> invert the peri input
#               0x2 -> drive peri input low
#               0x3 -> drive peri input high
.equ	IO_BANK0_GPIO42_CTRL_INOVER_RESET, 0x0
.equ	IO_BANK0_GPIO42_CTRL_INOVER_BITS, 0x00030000
.equ	IO_BANK0_GPIO42_CTRL_INOVER_MSB, 17
.equ	IO_BANK0_GPIO42_CTRL_INOVER_LSB, 16
.equ	IO_BANK0_GPIO42_CTRL_INOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO42_CTRL_INOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO42_CTRL_INOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO42_CTRL_INOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO42_CTRL_OEOVER
#               0x0 -> drive output enable from peripheral signal selected by funcsel
#               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
#               0x2 -> disable output
#               0x3 -> enable output
.equ	IO_BANK0_GPIO42_CTRL_OEOVER_RESET, 0x0
.equ	IO_BANK0_GPIO42_CTRL_OEOVER_BITS, 0x0000c000
.equ	IO_BANK0_GPIO42_CTRL_OEOVER_MSB, 15
.equ	IO_BANK0_GPIO42_CTRL_OEOVER_LSB, 14
.equ	IO_BANK0_GPIO42_CTRL_OEOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO42_CTRL_OEOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO42_CTRL_OEOVER_VALUE_DISABLE, 0x2
.equ	IO_BANK0_GPIO42_CTRL_OEOVER_VALUE_ENABLE, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO42_CTRL_OUTOVER
#               0x0 -> drive output from peripheral signal selected by funcsel
#               0x1 -> drive output from inverse of peripheral signal selected by funcsel
#               0x2 -> drive output low
#               0x3 -> drive output high
.equ	IO_BANK0_GPIO42_CTRL_OUTOVER_RESET, 0x0
.equ	IO_BANK0_GPIO42_CTRL_OUTOVER_BITS, 0x00003000
.equ	IO_BANK0_GPIO42_CTRL_OUTOVER_MSB, 13
.equ	IO_BANK0_GPIO42_CTRL_OUTOVER_LSB, 12
.equ	IO_BANK0_GPIO42_CTRL_OUTOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO42_CTRL_OUTOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO42_CTRL_OUTOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO42_CTRL_OUTOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO42_CTRL_FUNCSEL
# Description : 0-31 -> selects pin function according to the gpio table
#               31 == NULL
#               0x01 -> spi1_sclk
#               0x02 -> uart1_cts
#               0x03 -> i2c1_sda
#               0x04 -> pwm_a_9
#               0x05 -> siob_proc_42
#               0x06 -> pio0_42
#               0x07 -> pio1_42
#               0x08 -> pio2_42
#               0x0a -> usb_muxing_overcurr_detect
#               0x0b -> uart1_tx
#               0x1f -> null
.equ	IO_BANK0_GPIO42_CTRL_FUNCSEL_RESET, 0x1f
.equ	IO_BANK0_GPIO42_CTRL_FUNCSEL_BITS, 0x0000001f
.equ	IO_BANK0_GPIO42_CTRL_FUNCSEL_MSB, 4
.equ	IO_BANK0_GPIO42_CTRL_FUNCSEL_LSB, 0
.equ	IO_BANK0_GPIO42_CTRL_FUNCSEL_VALUE_SPI1_SCLK, 0x01
.equ	IO_BANK0_GPIO42_CTRL_FUNCSEL_VALUE_UART1_CTS, 0x02
.equ	IO_BANK0_GPIO42_CTRL_FUNCSEL_VALUE_I2C1_SDA, 0x03
.equ	IO_BANK0_GPIO42_CTRL_FUNCSEL_VALUE_PWM_A_9, 0x04
.equ	IO_BANK0_GPIO42_CTRL_FUNCSEL_VALUE_SIOB_PROC_42, 0x05
.equ	IO_BANK0_GPIO42_CTRL_FUNCSEL_VALUE_PIO0_42, 0x06
.equ	IO_BANK0_GPIO42_CTRL_FUNCSEL_VALUE_PIO1_42, 0x07
.equ	IO_BANK0_GPIO42_CTRL_FUNCSEL_VALUE_PIO2_42, 0x08
.equ	IO_BANK0_GPIO42_CTRL_FUNCSEL_VALUE_USB_MUXING_OVERCURR_DETECT, 0x0a
.equ	IO_BANK0_GPIO42_CTRL_FUNCSEL_VALUE_UART1_TX, 0x0b
.equ	IO_BANK0_GPIO42_CTRL_FUNCSEL_VALUE_NULL, 0x1f
# =============================================================================
# Register    : IO_BANK0_GPIO43_STATUS
.equ	IO_BANK0_GPIO43_STATUS_OFFSET, 0x00000158
.equ	IO_BANK0_GPIO43_STATUS_BITS, 0x04022200
.equ	IO_BANK0_GPIO43_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO43_STATUS_IRQTOPROC
# Description : interrupt to processors, after override is applied
.equ	IO_BANK0_GPIO43_STATUS_IRQTOPROC_RESET, 0x0
.equ	IO_BANK0_GPIO43_STATUS_IRQTOPROC_BITS, 0x04000000
.equ	IO_BANK0_GPIO43_STATUS_IRQTOPROC_MSB, 26
.equ	IO_BANK0_GPIO43_STATUS_IRQTOPROC_LSB, 26
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO43_STATUS_INFROMPAD
# Description : input signal from pad, before filtering and override are
#               applied
.equ	IO_BANK0_GPIO43_STATUS_INFROMPAD_RESET, 0x0
.equ	IO_BANK0_GPIO43_STATUS_INFROMPAD_BITS, 0x00020000
.equ	IO_BANK0_GPIO43_STATUS_INFROMPAD_MSB, 17
.equ	IO_BANK0_GPIO43_STATUS_INFROMPAD_LSB, 17
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO43_STATUS_OETOPAD
# Description : output enable to pad after register override is applied
.equ	IO_BANK0_GPIO43_STATUS_OETOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO43_STATUS_OETOPAD_BITS, 0x00002000
.equ	IO_BANK0_GPIO43_STATUS_OETOPAD_MSB, 13
.equ	IO_BANK0_GPIO43_STATUS_OETOPAD_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO43_STATUS_OUTTOPAD
# Description : output signal to pad after register override is applied
.equ	IO_BANK0_GPIO43_STATUS_OUTTOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO43_STATUS_OUTTOPAD_BITS, 0x00000200
.equ	IO_BANK0_GPIO43_STATUS_OUTTOPAD_MSB, 9
.equ	IO_BANK0_GPIO43_STATUS_OUTTOPAD_LSB, 9
# =============================================================================
# Register    : IO_BANK0_GPIO43_CTRL
.equ	IO_BANK0_GPIO43_CTRL_OFFSET, 0x0000015c
.equ	IO_BANK0_GPIO43_CTRL_BITS, 0x3003f01f
.equ	IO_BANK0_GPIO43_CTRL_RESET, 0x0000001f
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO43_CTRL_IRQOVER
#               0x0 -> don't invert the interrupt
#               0x1 -> invert the interrupt
#               0x2 -> drive interrupt low
#               0x3 -> drive interrupt high
.equ	IO_BANK0_GPIO43_CTRL_IRQOVER_RESET, 0x0
.equ	IO_BANK0_GPIO43_CTRL_IRQOVER_BITS, 0x30000000
.equ	IO_BANK0_GPIO43_CTRL_IRQOVER_MSB, 29
.equ	IO_BANK0_GPIO43_CTRL_IRQOVER_LSB, 28
.equ	IO_BANK0_GPIO43_CTRL_IRQOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO43_CTRL_IRQOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO43_CTRL_IRQOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO43_CTRL_IRQOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO43_CTRL_INOVER
#               0x0 -> don't invert the peri input
#               0x1 -> invert the peri input
#               0x2 -> drive peri input low
#               0x3 -> drive peri input high
.equ	IO_BANK0_GPIO43_CTRL_INOVER_RESET, 0x0
.equ	IO_BANK0_GPIO43_CTRL_INOVER_BITS, 0x00030000
.equ	IO_BANK0_GPIO43_CTRL_INOVER_MSB, 17
.equ	IO_BANK0_GPIO43_CTRL_INOVER_LSB, 16
.equ	IO_BANK0_GPIO43_CTRL_INOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO43_CTRL_INOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO43_CTRL_INOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO43_CTRL_INOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO43_CTRL_OEOVER
#               0x0 -> drive output enable from peripheral signal selected by funcsel
#               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
#               0x2 -> disable output
#               0x3 -> enable output
.equ	IO_BANK0_GPIO43_CTRL_OEOVER_RESET, 0x0
.equ	IO_BANK0_GPIO43_CTRL_OEOVER_BITS, 0x0000c000
.equ	IO_BANK0_GPIO43_CTRL_OEOVER_MSB, 15
.equ	IO_BANK0_GPIO43_CTRL_OEOVER_LSB, 14
.equ	IO_BANK0_GPIO43_CTRL_OEOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO43_CTRL_OEOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO43_CTRL_OEOVER_VALUE_DISABLE, 0x2
.equ	IO_BANK0_GPIO43_CTRL_OEOVER_VALUE_ENABLE, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO43_CTRL_OUTOVER
#               0x0 -> drive output from peripheral signal selected by funcsel
#               0x1 -> drive output from inverse of peripheral signal selected by funcsel
#               0x2 -> drive output low
#               0x3 -> drive output high
.equ	IO_BANK0_GPIO43_CTRL_OUTOVER_RESET, 0x0
.equ	IO_BANK0_GPIO43_CTRL_OUTOVER_BITS, 0x00003000
.equ	IO_BANK0_GPIO43_CTRL_OUTOVER_MSB, 13
.equ	IO_BANK0_GPIO43_CTRL_OUTOVER_LSB, 12
.equ	IO_BANK0_GPIO43_CTRL_OUTOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO43_CTRL_OUTOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO43_CTRL_OUTOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO43_CTRL_OUTOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO43_CTRL_FUNCSEL
# Description : 0-31 -> selects pin function according to the gpio table
#               31 == NULL
#               0x01 -> spi1_tx
#               0x02 -> uart1_rts
#               0x03 -> i2c1_scl
#               0x04 -> pwm_b_9
#               0x05 -> siob_proc_43
#               0x06 -> pio0_43
#               0x07 -> pio1_43
#               0x08 -> pio2_43
#               0x0a -> usb_muxing_vbus_detect
#               0x0b -> uart1_rx
#               0x1f -> null
.equ	IO_BANK0_GPIO43_CTRL_FUNCSEL_RESET, 0x1f
.equ	IO_BANK0_GPIO43_CTRL_FUNCSEL_BITS, 0x0000001f
.equ	IO_BANK0_GPIO43_CTRL_FUNCSEL_MSB, 4
.equ	IO_BANK0_GPIO43_CTRL_FUNCSEL_LSB, 0
.equ	IO_BANK0_GPIO43_CTRL_FUNCSEL_VALUE_SPI1_TX, 0x01
.equ	IO_BANK0_GPIO43_CTRL_FUNCSEL_VALUE_UART1_RTS, 0x02
.equ	IO_BANK0_GPIO43_CTRL_FUNCSEL_VALUE_I2C1_SCL, 0x03
.equ	IO_BANK0_GPIO43_CTRL_FUNCSEL_VALUE_PWM_B_9, 0x04
.equ	IO_BANK0_GPIO43_CTRL_FUNCSEL_VALUE_SIOB_PROC_43, 0x05
.equ	IO_BANK0_GPIO43_CTRL_FUNCSEL_VALUE_PIO0_43, 0x06
.equ	IO_BANK0_GPIO43_CTRL_FUNCSEL_VALUE_PIO1_43, 0x07
.equ	IO_BANK0_GPIO43_CTRL_FUNCSEL_VALUE_PIO2_43, 0x08
.equ	IO_BANK0_GPIO43_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_DETECT, 0x0a
.equ	IO_BANK0_GPIO43_CTRL_FUNCSEL_VALUE_UART1_RX, 0x0b
.equ	IO_BANK0_GPIO43_CTRL_FUNCSEL_VALUE_NULL, 0x1f
# =============================================================================
# Register    : IO_BANK0_GPIO44_STATUS
.equ	IO_BANK0_GPIO44_STATUS_OFFSET, 0x00000160
.equ	IO_BANK0_GPIO44_STATUS_BITS, 0x04022200
.equ	IO_BANK0_GPIO44_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO44_STATUS_IRQTOPROC
# Description : interrupt to processors, after override is applied
.equ	IO_BANK0_GPIO44_STATUS_IRQTOPROC_RESET, 0x0
.equ	IO_BANK0_GPIO44_STATUS_IRQTOPROC_BITS, 0x04000000
.equ	IO_BANK0_GPIO44_STATUS_IRQTOPROC_MSB, 26
.equ	IO_BANK0_GPIO44_STATUS_IRQTOPROC_LSB, 26
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO44_STATUS_INFROMPAD
# Description : input signal from pad, before filtering and override are
#               applied
.equ	IO_BANK0_GPIO44_STATUS_INFROMPAD_RESET, 0x0
.equ	IO_BANK0_GPIO44_STATUS_INFROMPAD_BITS, 0x00020000
.equ	IO_BANK0_GPIO44_STATUS_INFROMPAD_MSB, 17
.equ	IO_BANK0_GPIO44_STATUS_INFROMPAD_LSB, 17
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO44_STATUS_OETOPAD
# Description : output enable to pad after register override is applied
.equ	IO_BANK0_GPIO44_STATUS_OETOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO44_STATUS_OETOPAD_BITS, 0x00002000
.equ	IO_BANK0_GPIO44_STATUS_OETOPAD_MSB, 13
.equ	IO_BANK0_GPIO44_STATUS_OETOPAD_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO44_STATUS_OUTTOPAD
# Description : output signal to pad after register override is applied
.equ	IO_BANK0_GPIO44_STATUS_OUTTOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO44_STATUS_OUTTOPAD_BITS, 0x00000200
.equ	IO_BANK0_GPIO44_STATUS_OUTTOPAD_MSB, 9
.equ	IO_BANK0_GPIO44_STATUS_OUTTOPAD_LSB, 9
# =============================================================================
# Register    : IO_BANK0_GPIO44_CTRL
.equ	IO_BANK0_GPIO44_CTRL_OFFSET, 0x00000164
.equ	IO_BANK0_GPIO44_CTRL_BITS, 0x3003f01f
.equ	IO_BANK0_GPIO44_CTRL_RESET, 0x0000001f
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO44_CTRL_IRQOVER
#               0x0 -> don't invert the interrupt
#               0x1 -> invert the interrupt
#               0x2 -> drive interrupt low
#               0x3 -> drive interrupt high
.equ	IO_BANK0_GPIO44_CTRL_IRQOVER_RESET, 0x0
.equ	IO_BANK0_GPIO44_CTRL_IRQOVER_BITS, 0x30000000
.equ	IO_BANK0_GPIO44_CTRL_IRQOVER_MSB, 29
.equ	IO_BANK0_GPIO44_CTRL_IRQOVER_LSB, 28
.equ	IO_BANK0_GPIO44_CTRL_IRQOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO44_CTRL_IRQOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO44_CTRL_IRQOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO44_CTRL_IRQOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO44_CTRL_INOVER
#               0x0 -> don't invert the peri input
#               0x1 -> invert the peri input
#               0x2 -> drive peri input low
#               0x3 -> drive peri input high
.equ	IO_BANK0_GPIO44_CTRL_INOVER_RESET, 0x0
.equ	IO_BANK0_GPIO44_CTRL_INOVER_BITS, 0x00030000
.equ	IO_BANK0_GPIO44_CTRL_INOVER_MSB, 17
.equ	IO_BANK0_GPIO44_CTRL_INOVER_LSB, 16
.equ	IO_BANK0_GPIO44_CTRL_INOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO44_CTRL_INOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO44_CTRL_INOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO44_CTRL_INOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO44_CTRL_OEOVER
#               0x0 -> drive output enable from peripheral signal selected by funcsel
#               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
#               0x2 -> disable output
#               0x3 -> enable output
.equ	IO_BANK0_GPIO44_CTRL_OEOVER_RESET, 0x0
.equ	IO_BANK0_GPIO44_CTRL_OEOVER_BITS, 0x0000c000
.equ	IO_BANK0_GPIO44_CTRL_OEOVER_MSB, 15
.equ	IO_BANK0_GPIO44_CTRL_OEOVER_LSB, 14
.equ	IO_BANK0_GPIO44_CTRL_OEOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO44_CTRL_OEOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO44_CTRL_OEOVER_VALUE_DISABLE, 0x2
.equ	IO_BANK0_GPIO44_CTRL_OEOVER_VALUE_ENABLE, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO44_CTRL_OUTOVER
#               0x0 -> drive output from peripheral signal selected by funcsel
#               0x1 -> drive output from inverse of peripheral signal selected by funcsel
#               0x2 -> drive output low
#               0x3 -> drive output high
.equ	IO_BANK0_GPIO44_CTRL_OUTOVER_RESET, 0x0
.equ	IO_BANK0_GPIO44_CTRL_OUTOVER_BITS, 0x00003000
.equ	IO_BANK0_GPIO44_CTRL_OUTOVER_MSB, 13
.equ	IO_BANK0_GPIO44_CTRL_OUTOVER_LSB, 12
.equ	IO_BANK0_GPIO44_CTRL_OUTOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO44_CTRL_OUTOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO44_CTRL_OUTOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO44_CTRL_OUTOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO44_CTRL_FUNCSEL
# Description : 0-31 -> selects pin function according to the gpio table
#               31 == NULL
#               0x01 -> spi1_rx
#               0x02 -> uart0_tx
#               0x03 -> i2c0_sda
#               0x04 -> pwm_a_10
#               0x05 -> siob_proc_44
#               0x06 -> pio0_44
#               0x07 -> pio1_44
#               0x08 -> pio2_44
#               0x0a -> usb_muxing_vbus_en
#               0x1f -> null
.equ	IO_BANK0_GPIO44_CTRL_FUNCSEL_RESET, 0x1f
.equ	IO_BANK0_GPIO44_CTRL_FUNCSEL_BITS, 0x0000001f
.equ	IO_BANK0_GPIO44_CTRL_FUNCSEL_MSB, 4
.equ	IO_BANK0_GPIO44_CTRL_FUNCSEL_LSB, 0
.equ	IO_BANK0_GPIO44_CTRL_FUNCSEL_VALUE_SPI1_RX, 0x01
.equ	IO_BANK0_GPIO44_CTRL_FUNCSEL_VALUE_UART0_TX, 0x02
.equ	IO_BANK0_GPIO44_CTRL_FUNCSEL_VALUE_I2C0_SDA, 0x03
.equ	IO_BANK0_GPIO44_CTRL_FUNCSEL_VALUE_PWM_A_10, 0x04
.equ	IO_BANK0_GPIO44_CTRL_FUNCSEL_VALUE_SIOB_PROC_44, 0x05
.equ	IO_BANK0_GPIO44_CTRL_FUNCSEL_VALUE_PIO0_44, 0x06
.equ	IO_BANK0_GPIO44_CTRL_FUNCSEL_VALUE_PIO1_44, 0x07
.equ	IO_BANK0_GPIO44_CTRL_FUNCSEL_VALUE_PIO2_44, 0x08
.equ	IO_BANK0_GPIO44_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_EN, 0x0a
