konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/io_bank0.inc
.equ	IO_BANK0_GPIO44_CTRL_FUNCSEL_VALUE_NULL, 0x1f
# =============================================================================
# Register    : IO_BANK0_GPIO45_STATUS
.equ	IO_BANK0_GPIO45_STATUS_OFFSET, 0x00000168
.equ	IO_BANK0_GPIO45_STATUS_BITS, 0x04022200
.equ	IO_BANK0_GPIO45_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO45_STATUS_IRQTOPROC
# Description : interrupt to processors, after override is applied
.equ	IO_BANK0_GPIO45_STATUS_IRQTOPROC_RESET, 0x0
.equ	IO_BANK0_GPIO45_STATUS_IRQTOPROC_BITS, 0x04000000
.equ	IO_BANK0_GPIO45_STATUS_IRQTOPROC_MSB, 26
.equ	IO_BANK0_GPIO45_STATUS_IRQTOPROC_LSB, 26
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO45_STATUS_INFROMPAD
# Description : input signal from pad, before filtering and override are
#               applied
.equ	IO_BANK0_GPIO45_STATUS_INFROMPAD_RESET, 0x0
.equ	IO_BANK0_GPIO45_STATUS_INFROMPAD_BITS, 0x00020000
.equ	IO_BANK0_GPIO45_STATUS_INFROMPAD_MSB, 17
.equ	IO_BANK0_GPIO45_STATUS_INFROMPAD_LSB, 17
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO45_STATUS_OETOPAD
# Description : output enable to pad after register override is applied
.equ	IO_BANK0_GPIO45_STATUS_OETOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO45_STATUS_OETOPAD_BITS, 0x00002000
.equ	IO_BANK0_GPIO45_STATUS_OETOPAD_MSB, 13
.equ	IO_BANK0_GPIO45_STATUS_OETOPAD_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO45_STATUS_OUTTOPAD
# Description : output signal to pad after register override is applied
.equ	IO_BANK0_GPIO45_STATUS_OUTTOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO45_STATUS_OUTTOPAD_BITS, 0x00000200
.equ	IO_BANK0_GPIO45_STATUS_OUTTOPAD_MSB, 9
.equ	IO_BANK0_GPIO45_STATUS_OUTTOPAD_LSB, 9
# =============================================================================
# Register    : IO_BANK0_GPIO45_CTRL
.equ	IO_BANK0_GPIO45_CTRL_OFFSET, 0x0000016c
.equ	IO_BANK0_GPIO45_CTRL_BITS, 0x3003f01f
.equ	IO_BANK0_GPIO45_CTRL_RESET, 0x0000001f
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO45_CTRL_IRQOVER
#               0x0 -> don't invert the interrupt
#               0x1 -> invert the interrupt
#               0x2 -> drive interrupt low
#               0x3 -> drive interrupt high
.equ	IO_BANK0_GPIO45_CTRL_IRQOVER_RESET, 0x0
.equ	IO_BANK0_GPIO45_CTRL_IRQOVER_BITS, 0x30000000
.equ	IO_BANK0_GPIO45_CTRL_IRQOVER_MSB, 29
.equ	IO_BANK0_GPIO45_CTRL_IRQOVER_LSB, 28
.equ	IO_BANK0_GPIO45_CTRL_IRQOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO45_CTRL_IRQOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO45_CTRL_IRQOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO45_CTRL_IRQOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO45_CTRL_INOVER
#               0x0 -> don't invert the peri input
#               0x1 -> invert the peri input
#               0x2 -> drive peri input low
#               0x3 -> drive peri input high
.equ	IO_BANK0_GPIO45_CTRL_INOVER_RESET, 0x0
.equ	IO_BANK0_GPIO45_CTRL_INOVER_BITS, 0x00030000
.equ	IO_BANK0_GPIO45_CTRL_INOVER_MSB, 17
.equ	IO_BANK0_GPIO45_CTRL_INOVER_LSB, 16
.equ	IO_BANK0_GPIO45_CTRL_INOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO45_CTRL_INOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO45_CTRL_INOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO45_CTRL_INOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO45_CTRL_OEOVER
#               0x0 -> drive output enable from peripheral signal selected by funcsel
#               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
#               0x2 -> disable output
#               0x3 -> enable output
.equ	IO_BANK0_GPIO45_CTRL_OEOVER_RESET, 0x0
.equ	IO_BANK0_GPIO45_CTRL_OEOVER_BITS, 0x0000c000
.equ	IO_BANK0_GPIO45_CTRL_OEOVER_MSB, 15
.equ	IO_BANK0_GPIO45_CTRL_OEOVER_LSB, 14
.equ	IO_BANK0_GPIO45_CTRL_OEOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO45_CTRL_OEOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO45_CTRL_OEOVER_VALUE_DISABLE, 0x2
.equ	IO_BANK0_GPIO45_CTRL_OEOVER_VALUE_ENABLE, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO45_CTRL_OUTOVER
#               0x0 -> drive output from peripheral signal selected by funcsel
#               0x1 -> drive output from inverse of peripheral signal selected by funcsel
#               0x2 -> drive output low
#               0x3 -> drive output high
.equ	IO_BANK0_GPIO45_CTRL_OUTOVER_RESET, 0x0
.equ	IO_BANK0_GPIO45_CTRL_OUTOVER_BITS, 0x00003000
.equ	IO_BANK0_GPIO45_CTRL_OUTOVER_MSB, 13
.equ	IO_BANK0_GPIO45_CTRL_OUTOVER_LSB, 12
.equ	IO_BANK0_GPIO45_CTRL_OUTOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO45_CTRL_OUTOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO45_CTRL_OUTOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO45_CTRL_OUTOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO45_CTRL_FUNCSEL
# Description : 0-31 -> selects pin function according to the gpio table
#               31 == NULL
#               0x01 -> spi1_ss_n
#               0x02 -> uart0_rx
#               0x03 -> i2c0_scl
#               0x04 -> pwm_b_10
#               0x05 -> siob_proc_45
#               0x06 -> pio0_45
#               0x07 -> pio1_45
#               0x08 -> pio2_45
#               0x0a -> usb_muxing_overcurr_detect
#               0x1f -> null
.equ	IO_BANK0_GPIO45_CTRL_FUNCSEL_RESET, 0x1f
.equ	IO_BANK0_GPIO45_CTRL_FUNCSEL_BITS, 0x0000001f
.equ	IO_BANK0_GPIO45_CTRL_FUNCSEL_MSB, 4
.equ	IO_BANK0_GPIO45_CTRL_FUNCSEL_LSB, 0
.equ	IO_BANK0_GPIO45_CTRL_FUNCSEL_VALUE_SPI1_SS_N, 0x01
.equ	IO_BANK0_GPIO45_CTRL_FUNCSEL_VALUE_UART0_RX, 0x02
.equ	IO_BANK0_GPIO45_CTRL_FUNCSEL_VALUE_I2C0_SCL, 0x03
.equ	IO_BANK0_GPIO45_CTRL_FUNCSEL_VALUE_PWM_B_10, 0x04
.equ	IO_BANK0_GPIO45_CTRL_FUNCSEL_VALUE_SIOB_PROC_45, 0x05
.equ	IO_BANK0_GPIO45_CTRL_FUNCSEL_VALUE_PIO0_45, 0x06
.equ	IO_BANK0_GPIO45_CTRL_FUNCSEL_VALUE_PIO1_45, 0x07
.equ	IO_BANK0_GPIO45_CTRL_FUNCSEL_VALUE_PIO2_45, 0x08
.equ	IO_BANK0_GPIO45_CTRL_FUNCSEL_VALUE_USB_MUXING_OVERCURR_DETECT, 0x0a
.equ	IO_BANK0_GPIO45_CTRL_FUNCSEL_VALUE_NULL, 0x1f
# =============================================================================
# Register    : IO_BANK0_GPIO46_STATUS
.equ	IO_BANK0_GPIO46_STATUS_OFFSET, 0x00000170
.equ	IO_BANK0_GPIO46_STATUS_BITS, 0x04022200
.equ	IO_BANK0_GPIO46_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO46_STATUS_IRQTOPROC
# Description : interrupt to processors, after override is applied
.equ	IO_BANK0_GPIO46_STATUS_IRQTOPROC_RESET, 0x0
.equ	IO_BANK0_GPIO46_STATUS_IRQTOPROC_BITS, 0x04000000
.equ	IO_BANK0_GPIO46_STATUS_IRQTOPROC_MSB, 26
.equ	IO_BANK0_GPIO46_STATUS_IRQTOPROC_LSB, 26
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO46_STATUS_INFROMPAD
# Description : input signal from pad, before filtering and override are
#               applied
.equ	IO_BANK0_GPIO46_STATUS_INFROMPAD_RESET, 0x0
.equ	IO_BANK0_GPIO46_STATUS_INFROMPAD_BITS, 0x00020000
.equ	IO_BANK0_GPIO46_STATUS_INFROMPAD_MSB, 17
.equ	IO_BANK0_GPIO46_STATUS_INFROMPAD_LSB, 17
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO46_STATUS_OETOPAD
# Description : output enable to pad after register override is applied
.equ	IO_BANK0_GPIO46_STATUS_OETOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO46_STATUS_OETOPAD_BITS, 0x00002000
.equ	IO_BANK0_GPIO46_STATUS_OETOPAD_MSB, 13
.equ	IO_BANK0_GPIO46_STATUS_OETOPAD_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO46_STATUS_OUTTOPAD
# Description : output signal to pad after register override is applied
.equ	IO_BANK0_GPIO46_STATUS_OUTTOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO46_STATUS_OUTTOPAD_BITS, 0x00000200
.equ	IO_BANK0_GPIO46_STATUS_OUTTOPAD_MSB, 9
.equ	IO_BANK0_GPIO46_STATUS_OUTTOPAD_LSB, 9
# =============================================================================
# Register    : IO_BANK0_GPIO46_CTRL
.equ	IO_BANK0_GPIO46_CTRL_OFFSET, 0x00000174
.equ	IO_BANK0_GPIO46_CTRL_BITS, 0x3003f01f
.equ	IO_BANK0_GPIO46_CTRL_RESET, 0x0000001f
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO46_CTRL_IRQOVER
#               0x0 -> don't invert the interrupt
#               0x1 -> invert the interrupt
#               0x2 -> drive interrupt low
#               0x3 -> drive interrupt high
.equ	IO_BANK0_GPIO46_CTRL_IRQOVER_RESET, 0x0
.equ	IO_BANK0_GPIO46_CTRL_IRQOVER_BITS, 0x30000000
.equ	IO_BANK0_GPIO46_CTRL_IRQOVER_MSB, 29
.equ	IO_BANK0_GPIO46_CTRL_IRQOVER_LSB, 28
.equ	IO_BANK0_GPIO46_CTRL_IRQOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO46_CTRL_IRQOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO46_CTRL_IRQOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO46_CTRL_IRQOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO46_CTRL_INOVER
#               0x0 -> don't invert the peri input
#               0x1 -> invert the peri input
#               0x2 -> drive peri input low
#               0x3 -> drive peri input high
.equ	IO_BANK0_GPIO46_CTRL_INOVER_RESET, 0x0
.equ	IO_BANK0_GPIO46_CTRL_INOVER_BITS, 0x00030000
.equ	IO_BANK0_GPIO46_CTRL_INOVER_MSB, 17
.equ	IO_BANK0_GPIO46_CTRL_INOVER_LSB, 16
.equ	IO_BANK0_GPIO46_CTRL_INOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO46_CTRL_INOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO46_CTRL_INOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO46_CTRL_INOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO46_CTRL_OEOVER
#               0x0 -> drive output enable from peripheral signal selected by funcsel
#               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
#               0x2 -> disable output
#               0x3 -> enable output
.equ	IO_BANK0_GPIO46_CTRL_OEOVER_RESET, 0x0
.equ	IO_BANK0_GPIO46_CTRL_OEOVER_BITS, 0x0000c000
.equ	IO_BANK0_GPIO46_CTRL_OEOVER_MSB, 15
.equ	IO_BANK0_GPIO46_CTRL_OEOVER_LSB, 14
.equ	IO_BANK0_GPIO46_CTRL_OEOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO46_CTRL_OEOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO46_CTRL_OEOVER_VALUE_DISABLE, 0x2
.equ	IO_BANK0_GPIO46_CTRL_OEOVER_VALUE_ENABLE, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO46_CTRL_OUTOVER
#               0x0 -> drive output from peripheral signal selected by funcsel
#               0x1 -> drive output from inverse of peripheral signal selected by funcsel
#               0x2 -> drive output low
#               0x3 -> drive output high
.equ	IO_BANK0_GPIO46_CTRL_OUTOVER_RESET, 0x0
.equ	IO_BANK0_GPIO46_CTRL_OUTOVER_BITS, 0x00003000
.equ	IO_BANK0_GPIO46_CTRL_OUTOVER_MSB, 13
.equ	IO_BANK0_GPIO46_CTRL_OUTOVER_LSB, 12
.equ	IO_BANK0_GPIO46_CTRL_OUTOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO46_CTRL_OUTOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO46_CTRL_OUTOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO46_CTRL_OUTOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO46_CTRL_FUNCSEL
# Description : 0-31 -> selects pin function according to the gpio table
#               31 == NULL
#               0x01 -> spi1_sclk
#               0x02 -> uart0_cts
#               0x03 -> i2c1_sda
#               0x04 -> pwm_a_11
#               0x05 -> siob_proc_46
#               0x06 -> pio0_46
#               0x07 -> pio1_46
#               0x08 -> pio2_46
#               0x0a -> usb_muxing_vbus_detect
#               0x0b -> uart0_tx
#               0x1f -> null
.equ	IO_BANK0_GPIO46_CTRL_FUNCSEL_RESET, 0x1f
.equ	IO_BANK0_GPIO46_CTRL_FUNCSEL_BITS, 0x0000001f
.equ	IO_BANK0_GPIO46_CTRL_FUNCSEL_MSB, 4
.equ	IO_BANK0_GPIO46_CTRL_FUNCSEL_LSB, 0
.equ	IO_BANK0_GPIO46_CTRL_FUNCSEL_VALUE_SPI1_SCLK, 0x01
.equ	IO_BANK0_GPIO46_CTRL_FUNCSEL_VALUE_UART0_CTS, 0x02
.equ	IO_BANK0_GPIO46_CTRL_FUNCSEL_VALUE_I2C1_SDA, 0x03
.equ	IO_BANK0_GPIO46_CTRL_FUNCSEL_VALUE_PWM_A_11, 0x04
.equ	IO_BANK0_GPIO46_CTRL_FUNCSEL_VALUE_SIOB_PROC_46, 0x05
.equ	IO_BANK0_GPIO46_CTRL_FUNCSEL_VALUE_PIO0_46, 0x06
.equ	IO_BANK0_GPIO46_CTRL_FUNCSEL_VALUE_PIO1_46, 0x07
.equ	IO_BANK0_GPIO46_CTRL_FUNCSEL_VALUE_PIO2_46, 0x08
.equ	IO_BANK0_GPIO46_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_DETECT, 0x0a
.equ	IO_BANK0_GPIO46_CTRL_FUNCSEL_VALUE_UART0_TX, 0x0b
.equ	IO_BANK0_GPIO46_CTRL_FUNCSEL_VALUE_NULL, 0x1f
# =============================================================================
# Register    : IO_BANK0_GPIO47_STATUS
.equ	IO_BANK0_GPIO47_STATUS_OFFSET, 0x00000178
.equ	IO_BANK0_GPIO47_STATUS_BITS, 0x04022200
.equ	IO_BANK0_GPIO47_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO47_STATUS_IRQTOPROC
# Description : interrupt to processors, after override is applied
.equ	IO_BANK0_GPIO47_STATUS_IRQTOPROC_RESET, 0x0
.equ	IO_BANK0_GPIO47_STATUS_IRQTOPROC_BITS, 0x04000000
.equ	IO_BANK0_GPIO47_STATUS_IRQTOPROC_MSB, 26
.equ	IO_BANK0_GPIO47_STATUS_IRQTOPROC_LSB, 26
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO47_STATUS_INFROMPAD
# Description : input signal from pad, before filtering and override are
#               applied
.equ	IO_BANK0_GPIO47_STATUS_INFROMPAD_RESET, 0x0
.equ	IO_BANK0_GPIO47_STATUS_INFROMPAD_BITS, 0x00020000
.equ	IO_BANK0_GPIO47_STATUS_INFROMPAD_MSB, 17
.equ	IO_BANK0_GPIO47_STATUS_INFROMPAD_LSB, 17
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO47_STATUS_OETOPAD
# Description : output enable to pad after register override is applied
.equ	IO_BANK0_GPIO47_STATUS_OETOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO47_STATUS_OETOPAD_BITS, 0x00002000
.equ	IO_BANK0_GPIO47_STATUS_OETOPAD_MSB, 13
.equ	IO_BANK0_GPIO47_STATUS_OETOPAD_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO47_STATUS_OUTTOPAD
# Description : output signal to pad after register override is applied
.equ	IO_BANK0_GPIO47_STATUS_OUTTOPAD_RESET, 0x0
.equ	IO_BANK0_GPIO47_STATUS_OUTTOPAD_BITS, 0x00000200
.equ	IO_BANK0_GPIO47_STATUS_OUTTOPAD_MSB, 9
.equ	IO_BANK0_GPIO47_STATUS_OUTTOPAD_LSB, 9
# =============================================================================
# Register    : IO_BANK0_GPIO47_CTRL
.equ	IO_BANK0_GPIO47_CTRL_OFFSET, 0x0000017c
.equ	IO_BANK0_GPIO47_CTRL_BITS, 0x3003f01f
.equ	IO_BANK0_GPIO47_CTRL_RESET, 0x0000001f
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO47_CTRL_IRQOVER
#               0x0 -> don't invert the interrupt
#               0x1 -> invert the interrupt
#               0x2 -> drive interrupt low
#               0x3 -> drive interrupt high
.equ	IO_BANK0_GPIO47_CTRL_IRQOVER_RESET, 0x0
.equ	IO_BANK0_GPIO47_CTRL_IRQOVER_BITS, 0x30000000
.equ	IO_BANK0_GPIO47_CTRL_IRQOVER_MSB, 29
.equ	IO_BANK0_GPIO47_CTRL_IRQOVER_LSB, 28
.equ	IO_BANK0_GPIO47_CTRL_IRQOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO47_CTRL_IRQOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO47_CTRL_IRQOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO47_CTRL_IRQOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO47_CTRL_INOVER
#               0x0 -> don't invert the peri input
#               0x1 -> invert the peri input
#               0x2 -> drive peri input low
#               0x3 -> drive peri input high
.equ	IO_BANK0_GPIO47_CTRL_INOVER_RESET, 0x0
.equ	IO_BANK0_GPIO47_CTRL_INOVER_BITS, 0x00030000
.equ	IO_BANK0_GPIO47_CTRL_INOVER_MSB, 17
.equ	IO_BANK0_GPIO47_CTRL_INOVER_LSB, 16
.equ	IO_BANK0_GPIO47_CTRL_INOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO47_CTRL_INOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO47_CTRL_INOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO47_CTRL_INOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO47_CTRL_OEOVER
#               0x0 -> drive output enable from peripheral signal selected by funcsel
#               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
#               0x2 -> disable output
#               0x3 -> enable output
.equ	IO_BANK0_GPIO47_CTRL_OEOVER_RESET, 0x0
.equ	IO_BANK0_GPIO47_CTRL_OEOVER_BITS, 0x0000c000
.equ	IO_BANK0_GPIO47_CTRL_OEOVER_MSB, 15
.equ	IO_BANK0_GPIO47_CTRL_OEOVER_LSB, 14
.equ	IO_BANK0_GPIO47_CTRL_OEOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO47_CTRL_OEOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO47_CTRL_OEOVER_VALUE_DISABLE, 0x2
.equ	IO_BANK0_GPIO47_CTRL_OEOVER_VALUE_ENABLE, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO47_CTRL_OUTOVER
#               0x0 -> drive output from peripheral signal selected by funcsel
#               0x1 -> drive output from inverse of peripheral signal selected by funcsel
#               0x2 -> drive output low
#               0x3 -> drive output high
.equ	IO_BANK0_GPIO47_CTRL_OUTOVER_RESET, 0x0
.equ	IO_BANK0_GPIO47_CTRL_OUTOVER_BITS, 0x00003000
.equ	IO_BANK0_GPIO47_CTRL_OUTOVER_MSB, 13
.equ	IO_BANK0_GPIO47_CTRL_OUTOVER_LSB, 12
.equ	IO_BANK0_GPIO47_CTRL_OUTOVER_VALUE_NORMAL, 0x0
.equ	IO_BANK0_GPIO47_CTRL_OUTOVER_VALUE_INVERT, 0x1
.equ	IO_BANK0_GPIO47_CTRL_OUTOVER_VALUE_LOW, 0x2
.equ	IO_BANK0_GPIO47_CTRL_OUTOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_GPIO47_CTRL_FUNCSEL
# Description : 0-31 -> selects pin function according to the gpio table
#               31 == NULL
#               0x01 -> spi1_tx
#               0x02 -> uart0_rts
#               0x03 -> i2c1_scl
#               0x04 -> pwm_b_11
#               0x05 -> siob_proc_47
#               0x06 -> pio0_47
#               0x07 -> pio1_47
#               0x08 -> pio2_47
#               0x09 -> xip_ss_n_1
#               0x0a -> usb_muxing_vbus_en
#               0x0b -> uart0_rx
#               0x1f -> null
.equ	IO_BANK0_GPIO47_CTRL_FUNCSEL_RESET, 0x1f
.equ	IO_BANK0_GPIO47_CTRL_FUNCSEL_BITS, 0x0000001f
.equ	IO_BANK0_GPIO47_CTRL_FUNCSEL_MSB, 4
.equ	IO_BANK0_GPIO47_CTRL_FUNCSEL_LSB, 0
.equ	IO_BANK0_GPIO47_CTRL_FUNCSEL_VALUE_SPI1_TX, 0x01
.equ	IO_BANK0_GPIO47_CTRL_FUNCSEL_VALUE_UART0_RTS, 0x02
.equ	IO_BANK0_GPIO47_CTRL_FUNCSEL_VALUE_I2C1_SCL, 0x03
.equ	IO_BANK0_GPIO47_CTRL_FUNCSEL_VALUE_PWM_B_11, 0x04
.equ	IO_BANK0_GPIO47_CTRL_FUNCSEL_VALUE_SIOB_PROC_47, 0x05
.equ	IO_BANK0_GPIO47_CTRL_FUNCSEL_VALUE_PIO0_47, 0x06
.equ	IO_BANK0_GPIO47_CTRL_FUNCSEL_VALUE_PIO1_47, 0x07
.equ	IO_BANK0_GPIO47_CTRL_FUNCSEL_VALUE_PIO2_47, 0x08
.equ	IO_BANK0_GPIO47_CTRL_FUNCSEL_VALUE_XIP_SS_N_1, 0x09
.equ	IO_BANK0_GPIO47_CTRL_FUNCSEL_VALUE_USB_MUXING_VBUS_EN, 0x0a
.equ	IO_BANK0_GPIO47_CTRL_FUNCSEL_VALUE_UART0_RX, 0x0b
.equ	IO_BANK0_GPIO47_CTRL_FUNCSEL_VALUE_NULL, 0x1f
# =============================================================================
# Register    : IO_BANK0_IRQSUMMARY_PROC0_SECURE0
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_OFFSET, 0x00000200
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_BITS, 0xffffffff
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO31
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO31_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO31_BITS, 0x80000000
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO31_MSB, 31
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO31_LSB, 31
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO30
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO30_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO30_BITS, 0x40000000
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO30_MSB, 30
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO30_LSB, 30
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO29
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO29_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO29_BITS, 0x20000000
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO29_MSB, 29
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO29_LSB, 29
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO28
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO28_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO28_BITS, 0x10000000
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO28_MSB, 28
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO28_LSB, 28
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO27
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO27_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO27_BITS, 0x08000000
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO27_MSB, 27
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO27_LSB, 27
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO26
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO26_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO26_BITS, 0x04000000
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO26_MSB, 26
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO26_LSB, 26
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO25
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO25_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO25_BITS, 0x02000000
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO25_MSB, 25
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO25_LSB, 25
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO24
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO24_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO24_BITS, 0x01000000
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO24_MSB, 24
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO24_LSB, 24
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO23
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO23_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO23_BITS, 0x00800000
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO23_MSB, 23
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO23_LSB, 23
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO22
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO22_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO22_BITS, 0x00400000
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO22_MSB, 22
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO22_LSB, 22
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO21
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO21_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO21_BITS, 0x00200000
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO21_MSB, 21
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO21_LSB, 21
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO20
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO20_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO20_BITS, 0x00100000
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO20_MSB, 20
.equ	IO_BANK0_IRQSUMMARY_PROC0_SECURE0_GPIO20_LSB, 20
# -----------------------------------------------------------------------------
