konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/io_bank0.inc
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO15_BITS, 0x00008000
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO15_MSB, 15
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO15_LSB, 15
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO14
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO14_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO14_BITS, 0x00004000
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO14_MSB, 14
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO14_LSB, 14
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO13
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO13_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO13_BITS, 0x00002000
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO13_MSB, 13
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO13_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO12
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO12_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO12_BITS, 0x00001000
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO12_MSB, 12
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO12_LSB, 12
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO11
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO11_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO11_BITS, 0x00000800
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO11_MSB, 11
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO11_LSB, 11
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO10
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO10_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO10_BITS, 0x00000400
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO10_MSB, 10
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO10_LSB, 10
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO9
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO9_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO9_BITS, 0x00000200
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO9_MSB, 9
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO9_LSB, 9
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO8
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO8_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO8_BITS, 0x00000100
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO8_MSB, 8
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO8_LSB, 8
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO7
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO7_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO7_BITS, 0x00000080
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO7_MSB, 7
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO7_LSB, 7
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO6
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO6_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO6_BITS, 0x00000040
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO6_MSB, 6
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO6_LSB, 6
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO5
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO5_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO5_BITS, 0x00000020
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO5_MSB, 5
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO5_LSB, 5
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO4
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO4_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO4_BITS, 0x00000010
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO4_MSB, 4
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO4_LSB, 4
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO3
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO3_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO3_BITS, 0x00000008
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO3_MSB, 3
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO3_LSB, 3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO2
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO2_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO2_BITS, 0x00000004
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO2_MSB, 2
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO2_LSB, 2
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO1
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO1_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO1_BITS, 0x00000002
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO1_MSB, 1
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO1_LSB, 1
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO0_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO0_BITS, 0x00000001
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO0_MSB, 0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE0_GPIO0_LSB, 0
# =============================================================================
# Register    : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_OFFSET, 0x0000022c
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_BITS, 0x0000ffff
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO47
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO47_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO47_BITS, 0x00008000
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO47_MSB, 15
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO47_LSB, 15
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO46
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO46_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO46_BITS, 0x00004000
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO46_MSB, 14
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO46_LSB, 14
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO45
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO45_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO45_BITS, 0x00002000
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO45_MSB, 13
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO45_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO44
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO44_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO44_BITS, 0x00001000
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO44_MSB, 12
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO44_LSB, 12
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO43
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO43_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO43_BITS, 0x00000800
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO43_MSB, 11
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO43_LSB, 11
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO42
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO42_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO42_BITS, 0x00000400
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO42_MSB, 10
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO42_LSB, 10
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO41
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO41_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO41_BITS, 0x00000200
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO41_MSB, 9
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO41_LSB, 9
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO40
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO40_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO40_BITS, 0x00000100
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO40_MSB, 8
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO40_LSB, 8
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO39
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO39_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO39_BITS, 0x00000080
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO39_MSB, 7
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO39_LSB, 7
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO38
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO38_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO38_BITS, 0x00000040
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO38_MSB, 6
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO38_LSB, 6
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO37
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO37_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO37_BITS, 0x00000020
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO37_MSB, 5
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO37_LSB, 5
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO36
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO36_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO36_BITS, 0x00000010
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO36_MSB, 4
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO36_LSB, 4
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO35
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO35_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO35_BITS, 0x00000008
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO35_MSB, 3
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO35_LSB, 3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO34
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO34_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO34_BITS, 0x00000004
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO34_MSB, 2
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO34_LSB, 2
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO33
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO33_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO33_BITS, 0x00000002
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO33_MSB, 1
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO33_LSB, 1
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO32
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO32_RESET, 0x0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO32_BITS, 0x00000001
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO32_MSB, 0
.equ	IO_BANK0_IRQSUMMARY_DORMANT_WAKE_NONSECURE1_GPIO32_LSB, 0
# =============================================================================
# Register    : IO_BANK0_INTR0
# Description : Raw Interrupts
.equ	IO_BANK0_INTR0_OFFSET, 0x00000230
.equ	IO_BANK0_INTR0_BITS, 0xffffffff
.equ	IO_BANK0_INTR0_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO7_EDGE_HIGH
.equ	IO_BANK0_INTR0_GPIO7_EDGE_HIGH_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO7_EDGE_HIGH_BITS, 0x80000000
.equ	IO_BANK0_INTR0_GPIO7_EDGE_HIGH_MSB, 31
.equ	IO_BANK0_INTR0_GPIO7_EDGE_HIGH_LSB, 31
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO7_EDGE_LOW
.equ	IO_BANK0_INTR0_GPIO7_EDGE_LOW_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO7_EDGE_LOW_BITS, 0x40000000
.equ	IO_BANK0_INTR0_GPIO7_EDGE_LOW_MSB, 30
.equ	IO_BANK0_INTR0_GPIO7_EDGE_LOW_LSB, 30
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO7_LEVEL_HIGH
.equ	IO_BANK0_INTR0_GPIO7_LEVEL_HIGH_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO7_LEVEL_HIGH_BITS, 0x20000000
.equ	IO_BANK0_INTR0_GPIO7_LEVEL_HIGH_MSB, 29
.equ	IO_BANK0_INTR0_GPIO7_LEVEL_HIGH_LSB, 29
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO7_LEVEL_LOW
.equ	IO_BANK0_INTR0_GPIO7_LEVEL_LOW_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO7_LEVEL_LOW_BITS, 0x10000000
.equ	IO_BANK0_INTR0_GPIO7_LEVEL_LOW_MSB, 28
.equ	IO_BANK0_INTR0_GPIO7_LEVEL_LOW_LSB, 28
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO6_EDGE_HIGH
.equ	IO_BANK0_INTR0_GPIO6_EDGE_HIGH_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO6_EDGE_HIGH_BITS, 0x08000000
.equ	IO_BANK0_INTR0_GPIO6_EDGE_HIGH_MSB, 27
.equ	IO_BANK0_INTR0_GPIO6_EDGE_HIGH_LSB, 27
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO6_EDGE_LOW
.equ	IO_BANK0_INTR0_GPIO6_EDGE_LOW_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO6_EDGE_LOW_BITS, 0x04000000
.equ	IO_BANK0_INTR0_GPIO6_EDGE_LOW_MSB, 26
.equ	IO_BANK0_INTR0_GPIO6_EDGE_LOW_LSB, 26
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO6_LEVEL_HIGH
.equ	IO_BANK0_INTR0_GPIO6_LEVEL_HIGH_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO6_LEVEL_HIGH_BITS, 0x02000000
.equ	IO_BANK0_INTR0_GPIO6_LEVEL_HIGH_MSB, 25
.equ	IO_BANK0_INTR0_GPIO6_LEVEL_HIGH_LSB, 25
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO6_LEVEL_LOW
.equ	IO_BANK0_INTR0_GPIO6_LEVEL_LOW_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO6_LEVEL_LOW_BITS, 0x01000000
.equ	IO_BANK0_INTR0_GPIO6_LEVEL_LOW_MSB, 24
.equ	IO_BANK0_INTR0_GPIO6_LEVEL_LOW_LSB, 24
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO5_EDGE_HIGH
.equ	IO_BANK0_INTR0_GPIO5_EDGE_HIGH_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO5_EDGE_HIGH_BITS, 0x00800000
.equ	IO_BANK0_INTR0_GPIO5_EDGE_HIGH_MSB, 23
.equ	IO_BANK0_INTR0_GPIO5_EDGE_HIGH_LSB, 23
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO5_EDGE_LOW
.equ	IO_BANK0_INTR0_GPIO5_EDGE_LOW_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO5_EDGE_LOW_BITS, 0x00400000
.equ	IO_BANK0_INTR0_GPIO5_EDGE_LOW_MSB, 22
.equ	IO_BANK0_INTR0_GPIO5_EDGE_LOW_LSB, 22
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO5_LEVEL_HIGH
.equ	IO_BANK0_INTR0_GPIO5_LEVEL_HIGH_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO5_LEVEL_HIGH_BITS, 0x00200000
.equ	IO_BANK0_INTR0_GPIO5_LEVEL_HIGH_MSB, 21
.equ	IO_BANK0_INTR0_GPIO5_LEVEL_HIGH_LSB, 21
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO5_LEVEL_LOW
.equ	IO_BANK0_INTR0_GPIO5_LEVEL_LOW_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO5_LEVEL_LOW_BITS, 0x00100000
.equ	IO_BANK0_INTR0_GPIO5_LEVEL_LOW_MSB, 20
.equ	IO_BANK0_INTR0_GPIO5_LEVEL_LOW_LSB, 20
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO4_EDGE_HIGH
.equ	IO_BANK0_INTR0_GPIO4_EDGE_HIGH_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO4_EDGE_HIGH_BITS, 0x00080000
.equ	IO_BANK0_INTR0_GPIO4_EDGE_HIGH_MSB, 19
.equ	IO_BANK0_INTR0_GPIO4_EDGE_HIGH_LSB, 19
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO4_EDGE_LOW
.equ	IO_BANK0_INTR0_GPIO4_EDGE_LOW_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO4_EDGE_LOW_BITS, 0x00040000
.equ	IO_BANK0_INTR0_GPIO4_EDGE_LOW_MSB, 18
.equ	IO_BANK0_INTR0_GPIO4_EDGE_LOW_LSB, 18
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO4_LEVEL_HIGH
.equ	IO_BANK0_INTR0_GPIO4_LEVEL_HIGH_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO4_LEVEL_HIGH_BITS, 0x00020000
.equ	IO_BANK0_INTR0_GPIO4_LEVEL_HIGH_MSB, 17
.equ	IO_BANK0_INTR0_GPIO4_LEVEL_HIGH_LSB, 17
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO4_LEVEL_LOW
.equ	IO_BANK0_INTR0_GPIO4_LEVEL_LOW_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO4_LEVEL_LOW_BITS, 0x00010000
.equ	IO_BANK0_INTR0_GPIO4_LEVEL_LOW_MSB, 16
.equ	IO_BANK0_INTR0_GPIO4_LEVEL_LOW_LSB, 16
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO3_EDGE_HIGH
.equ	IO_BANK0_INTR0_GPIO3_EDGE_HIGH_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO3_EDGE_HIGH_BITS, 0x00008000
.equ	IO_BANK0_INTR0_GPIO3_EDGE_HIGH_MSB, 15
.equ	IO_BANK0_INTR0_GPIO3_EDGE_HIGH_LSB, 15
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO3_EDGE_LOW
.equ	IO_BANK0_INTR0_GPIO3_EDGE_LOW_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO3_EDGE_LOW_BITS, 0x00004000
.equ	IO_BANK0_INTR0_GPIO3_EDGE_LOW_MSB, 14
.equ	IO_BANK0_INTR0_GPIO3_EDGE_LOW_LSB, 14
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO3_LEVEL_HIGH
.equ	IO_BANK0_INTR0_GPIO3_LEVEL_HIGH_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO3_LEVEL_HIGH_BITS, 0x00002000
.equ	IO_BANK0_INTR0_GPIO3_LEVEL_HIGH_MSB, 13
.equ	IO_BANK0_INTR0_GPIO3_LEVEL_HIGH_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO3_LEVEL_LOW
.equ	IO_BANK0_INTR0_GPIO3_LEVEL_LOW_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO3_LEVEL_LOW_BITS, 0x00001000
.equ	IO_BANK0_INTR0_GPIO3_LEVEL_LOW_MSB, 12
.equ	IO_BANK0_INTR0_GPIO3_LEVEL_LOW_LSB, 12
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO2_EDGE_HIGH
.equ	IO_BANK0_INTR0_GPIO2_EDGE_HIGH_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO2_EDGE_HIGH_BITS, 0x00000800
.equ	IO_BANK0_INTR0_GPIO2_EDGE_HIGH_MSB, 11
.equ	IO_BANK0_INTR0_GPIO2_EDGE_HIGH_LSB, 11
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO2_EDGE_LOW
.equ	IO_BANK0_INTR0_GPIO2_EDGE_LOW_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO2_EDGE_LOW_BITS, 0x00000400
.equ	IO_BANK0_INTR0_GPIO2_EDGE_LOW_MSB, 10
.equ	IO_BANK0_INTR0_GPIO2_EDGE_LOW_LSB, 10
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO2_LEVEL_HIGH
.equ	IO_BANK0_INTR0_GPIO2_LEVEL_HIGH_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO2_LEVEL_HIGH_BITS, 0x00000200
.equ	IO_BANK0_INTR0_GPIO2_LEVEL_HIGH_MSB, 9
.equ	IO_BANK0_INTR0_GPIO2_LEVEL_HIGH_LSB, 9
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO2_LEVEL_LOW
.equ	IO_BANK0_INTR0_GPIO2_LEVEL_LOW_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO2_LEVEL_LOW_BITS, 0x00000100
.equ	IO_BANK0_INTR0_GPIO2_LEVEL_LOW_MSB, 8
.equ	IO_BANK0_INTR0_GPIO2_LEVEL_LOW_LSB, 8
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO1_EDGE_HIGH
.equ	IO_BANK0_INTR0_GPIO1_EDGE_HIGH_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO1_EDGE_HIGH_BITS, 0x00000080
.equ	IO_BANK0_INTR0_GPIO1_EDGE_HIGH_MSB, 7
.equ	IO_BANK0_INTR0_GPIO1_EDGE_HIGH_LSB, 7
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO1_EDGE_LOW
.equ	IO_BANK0_INTR0_GPIO1_EDGE_LOW_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO1_EDGE_LOW_BITS, 0x00000040
.equ	IO_BANK0_INTR0_GPIO1_EDGE_LOW_MSB, 6
.equ	IO_BANK0_INTR0_GPIO1_EDGE_LOW_LSB, 6
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO1_LEVEL_HIGH
.equ	IO_BANK0_INTR0_GPIO1_LEVEL_HIGH_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO1_LEVEL_HIGH_BITS, 0x00000020
.equ	IO_BANK0_INTR0_GPIO1_LEVEL_HIGH_MSB, 5
.equ	IO_BANK0_INTR0_GPIO1_LEVEL_HIGH_LSB, 5
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO1_LEVEL_LOW
.equ	IO_BANK0_INTR0_GPIO1_LEVEL_LOW_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO1_LEVEL_LOW_BITS, 0x00000010
.equ	IO_BANK0_INTR0_GPIO1_LEVEL_LOW_MSB, 4
.equ	IO_BANK0_INTR0_GPIO1_LEVEL_LOW_LSB, 4
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO0_EDGE_HIGH
.equ	IO_BANK0_INTR0_GPIO0_EDGE_HIGH_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO0_EDGE_HIGH_BITS, 0x00000008
.equ	IO_BANK0_INTR0_GPIO0_EDGE_HIGH_MSB, 3
.equ	IO_BANK0_INTR0_GPIO0_EDGE_HIGH_LSB, 3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO0_EDGE_LOW
.equ	IO_BANK0_INTR0_GPIO0_EDGE_LOW_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO0_EDGE_LOW_BITS, 0x00000004
.equ	IO_BANK0_INTR0_GPIO0_EDGE_LOW_MSB, 2
.equ	IO_BANK0_INTR0_GPIO0_EDGE_LOW_LSB, 2
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO0_LEVEL_HIGH
.equ	IO_BANK0_INTR0_GPIO0_LEVEL_HIGH_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO0_LEVEL_HIGH_BITS, 0x00000002
.equ	IO_BANK0_INTR0_GPIO0_LEVEL_HIGH_MSB, 1
.equ	IO_BANK0_INTR0_GPIO0_LEVEL_HIGH_LSB, 1
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_INTR0_GPIO0_LEVEL_LOW
.equ	IO_BANK0_INTR0_GPIO0_LEVEL_LOW_RESET, 0x0
.equ	IO_BANK0_INTR0_GPIO0_LEVEL_LOW_BITS, 0x00000001
.equ	IO_BANK0_INTR0_GPIO0_LEVEL_LOW_MSB, 0
.equ	IO_BANK0_INTR0_GPIO0_LEVEL_LOW_LSB, 0
# =============================================================================
# Register    : IO_BANK0_INTR1
# Description : Raw Interrupts
.equ	IO_BANK0_INTR1_OFFSET, 0x00000234
.equ	IO_BANK0_INTR1_BITS, 0xffffffff
.equ	IO_BANK0_INTR1_RESET, 0x00000000
# -----------------------------------------------------------------------------
