konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/io_bank0.inc
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF2_GPIO17_LEVEL_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF2_GPIO17_LEVEL_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF2_GPIO17_LEVEL_LOW_BITS, 0x00000010
.equ	IO_BANK0_DORMANT_WAKE_INTF2_GPIO17_LEVEL_LOW_MSB, 4
.equ	IO_BANK0_DORMANT_WAKE_INTF2_GPIO17_LEVEL_LOW_LSB, 4
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF2_GPIO16_EDGE_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF2_GPIO16_EDGE_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF2_GPIO16_EDGE_HIGH_BITS, 0x00000008
.equ	IO_BANK0_DORMANT_WAKE_INTF2_GPIO16_EDGE_HIGH_MSB, 3
.equ	IO_BANK0_DORMANT_WAKE_INTF2_GPIO16_EDGE_HIGH_LSB, 3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF2_GPIO16_EDGE_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF2_GPIO16_EDGE_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF2_GPIO16_EDGE_LOW_BITS, 0x00000004
.equ	IO_BANK0_DORMANT_WAKE_INTF2_GPIO16_EDGE_LOW_MSB, 2
.equ	IO_BANK0_DORMANT_WAKE_INTF2_GPIO16_EDGE_LOW_LSB, 2
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF2_GPIO16_LEVEL_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF2_GPIO16_LEVEL_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF2_GPIO16_LEVEL_HIGH_BITS, 0x00000002
.equ	IO_BANK0_DORMANT_WAKE_INTF2_GPIO16_LEVEL_HIGH_MSB, 1
.equ	IO_BANK0_DORMANT_WAKE_INTF2_GPIO16_LEVEL_HIGH_LSB, 1
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF2_GPIO16_LEVEL_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF2_GPIO16_LEVEL_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF2_GPIO16_LEVEL_LOW_BITS, 0x00000001
.equ	IO_BANK0_DORMANT_WAKE_INTF2_GPIO16_LEVEL_LOW_MSB, 0
.equ	IO_BANK0_DORMANT_WAKE_INTF2_GPIO16_LEVEL_LOW_LSB, 0
# =============================================================================
# Register    : IO_BANK0_DORMANT_WAKE_INTF3
# Description : Interrupt Force for dormant_wake
.equ	IO_BANK0_DORMANT_WAKE_INTF3_OFFSET, 0x000002fc
.equ	IO_BANK0_DORMANT_WAKE_INTF3_BITS, 0xffffffff
.equ	IO_BANK0_DORMANT_WAKE_INTF3_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO31_EDGE_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO31_EDGE_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO31_EDGE_HIGH_BITS, 0x80000000
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO31_EDGE_HIGH_MSB, 31
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO31_EDGE_HIGH_LSB, 31
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO31_EDGE_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO31_EDGE_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO31_EDGE_LOW_BITS, 0x40000000
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO31_EDGE_LOW_MSB, 30
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO31_EDGE_LOW_LSB, 30
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO31_LEVEL_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO31_LEVEL_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO31_LEVEL_HIGH_BITS, 0x20000000
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO31_LEVEL_HIGH_MSB, 29
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO31_LEVEL_HIGH_LSB, 29
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO31_LEVEL_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO31_LEVEL_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO31_LEVEL_LOW_BITS, 0x10000000
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO31_LEVEL_LOW_MSB, 28
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO31_LEVEL_LOW_LSB, 28
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO30_EDGE_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO30_EDGE_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO30_EDGE_HIGH_BITS, 0x08000000
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO30_EDGE_HIGH_MSB, 27
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO30_EDGE_HIGH_LSB, 27
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO30_EDGE_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO30_EDGE_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO30_EDGE_LOW_BITS, 0x04000000
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO30_EDGE_LOW_MSB, 26
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO30_EDGE_LOW_LSB, 26
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO30_LEVEL_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO30_LEVEL_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO30_LEVEL_HIGH_BITS, 0x02000000
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO30_LEVEL_HIGH_MSB, 25
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO30_LEVEL_HIGH_LSB, 25
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO30_LEVEL_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO30_LEVEL_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO30_LEVEL_LOW_BITS, 0x01000000
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO30_LEVEL_LOW_MSB, 24
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO30_LEVEL_LOW_LSB, 24
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO29_EDGE_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO29_EDGE_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO29_EDGE_HIGH_BITS, 0x00800000
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO29_EDGE_HIGH_MSB, 23
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO29_EDGE_HIGH_LSB, 23
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO29_EDGE_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO29_EDGE_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO29_EDGE_LOW_BITS, 0x00400000
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO29_EDGE_LOW_MSB, 22
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO29_EDGE_LOW_LSB, 22
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO29_LEVEL_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO29_LEVEL_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO29_LEVEL_HIGH_BITS, 0x00200000
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO29_LEVEL_HIGH_MSB, 21
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO29_LEVEL_HIGH_LSB, 21
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO29_LEVEL_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO29_LEVEL_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO29_LEVEL_LOW_BITS, 0x00100000
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO29_LEVEL_LOW_MSB, 20
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO29_LEVEL_LOW_LSB, 20
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO28_EDGE_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO28_EDGE_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO28_EDGE_HIGH_BITS, 0x00080000
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO28_EDGE_HIGH_MSB, 19
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO28_EDGE_HIGH_LSB, 19
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO28_EDGE_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO28_EDGE_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO28_EDGE_LOW_BITS, 0x00040000
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO28_EDGE_LOW_MSB, 18
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO28_EDGE_LOW_LSB, 18
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO28_LEVEL_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO28_LEVEL_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO28_LEVEL_HIGH_BITS, 0x00020000
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO28_LEVEL_HIGH_MSB, 17
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO28_LEVEL_HIGH_LSB, 17
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO28_LEVEL_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO28_LEVEL_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO28_LEVEL_LOW_BITS, 0x00010000
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO28_LEVEL_LOW_MSB, 16
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO28_LEVEL_LOW_LSB, 16
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO27_EDGE_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO27_EDGE_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO27_EDGE_HIGH_BITS, 0x00008000
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO27_EDGE_HIGH_MSB, 15
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO27_EDGE_HIGH_LSB, 15
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO27_EDGE_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO27_EDGE_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO27_EDGE_LOW_BITS, 0x00004000
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO27_EDGE_LOW_MSB, 14
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO27_EDGE_LOW_LSB, 14
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO27_LEVEL_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO27_LEVEL_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO27_LEVEL_HIGH_BITS, 0x00002000
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO27_LEVEL_HIGH_MSB, 13
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO27_LEVEL_HIGH_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO27_LEVEL_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO27_LEVEL_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO27_LEVEL_LOW_BITS, 0x00001000
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO27_LEVEL_LOW_MSB, 12
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO27_LEVEL_LOW_LSB, 12
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO26_EDGE_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO26_EDGE_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO26_EDGE_HIGH_BITS, 0x00000800
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO26_EDGE_HIGH_MSB, 11
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO26_EDGE_HIGH_LSB, 11
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO26_EDGE_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO26_EDGE_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO26_EDGE_LOW_BITS, 0x00000400
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO26_EDGE_LOW_MSB, 10
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO26_EDGE_LOW_LSB, 10
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO26_LEVEL_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO26_LEVEL_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO26_LEVEL_HIGH_BITS, 0x00000200
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO26_LEVEL_HIGH_MSB, 9
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO26_LEVEL_HIGH_LSB, 9
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO26_LEVEL_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO26_LEVEL_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO26_LEVEL_LOW_BITS, 0x00000100
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO26_LEVEL_LOW_MSB, 8
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO26_LEVEL_LOW_LSB, 8
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO25_EDGE_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO25_EDGE_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO25_EDGE_HIGH_BITS, 0x00000080
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO25_EDGE_HIGH_MSB, 7
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO25_EDGE_HIGH_LSB, 7
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO25_EDGE_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO25_EDGE_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO25_EDGE_LOW_BITS, 0x00000040
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO25_EDGE_LOW_MSB, 6
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO25_EDGE_LOW_LSB, 6
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO25_LEVEL_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO25_LEVEL_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO25_LEVEL_HIGH_BITS, 0x00000020
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO25_LEVEL_HIGH_MSB, 5
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO25_LEVEL_HIGH_LSB, 5
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO25_LEVEL_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO25_LEVEL_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO25_LEVEL_LOW_BITS, 0x00000010
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO25_LEVEL_LOW_MSB, 4
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO25_LEVEL_LOW_LSB, 4
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO24_EDGE_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO24_EDGE_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO24_EDGE_HIGH_BITS, 0x00000008
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO24_EDGE_HIGH_MSB, 3
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO24_EDGE_HIGH_LSB, 3
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO24_EDGE_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO24_EDGE_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO24_EDGE_LOW_BITS, 0x00000004
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO24_EDGE_LOW_MSB, 2
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO24_EDGE_LOW_LSB, 2
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO24_LEVEL_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO24_LEVEL_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO24_LEVEL_HIGH_BITS, 0x00000002
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO24_LEVEL_HIGH_MSB, 1
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO24_LEVEL_HIGH_LSB, 1
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF3_GPIO24_LEVEL_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO24_LEVEL_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO24_LEVEL_LOW_BITS, 0x00000001
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO24_LEVEL_LOW_MSB, 0
.equ	IO_BANK0_DORMANT_WAKE_INTF3_GPIO24_LEVEL_LOW_LSB, 0
# =============================================================================
# Register    : IO_BANK0_DORMANT_WAKE_INTF4
# Description : Interrupt Force for dormant_wake
.equ	IO_BANK0_DORMANT_WAKE_INTF4_OFFSET, 0x00000300
.equ	IO_BANK0_DORMANT_WAKE_INTF4_BITS, 0xffffffff
.equ	IO_BANK0_DORMANT_WAKE_INTF4_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF4_GPIO39_EDGE_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO39_EDGE_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO39_EDGE_HIGH_BITS, 0x80000000
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO39_EDGE_HIGH_MSB, 31
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO39_EDGE_HIGH_LSB, 31
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF4_GPIO39_EDGE_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO39_EDGE_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO39_EDGE_LOW_BITS, 0x40000000
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO39_EDGE_LOW_MSB, 30
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO39_EDGE_LOW_LSB, 30
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF4_GPIO39_LEVEL_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO39_LEVEL_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO39_LEVEL_HIGH_BITS, 0x20000000
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO39_LEVEL_HIGH_MSB, 29
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO39_LEVEL_HIGH_LSB, 29
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF4_GPIO39_LEVEL_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO39_LEVEL_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO39_LEVEL_LOW_BITS, 0x10000000
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO39_LEVEL_LOW_MSB, 28
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO39_LEVEL_LOW_LSB, 28
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF4_GPIO38_EDGE_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO38_EDGE_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO38_EDGE_HIGH_BITS, 0x08000000
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO38_EDGE_HIGH_MSB, 27
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO38_EDGE_HIGH_LSB, 27
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF4_GPIO38_EDGE_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO38_EDGE_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO38_EDGE_LOW_BITS, 0x04000000
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO38_EDGE_LOW_MSB, 26
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO38_EDGE_LOW_LSB, 26
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF4_GPIO38_LEVEL_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO38_LEVEL_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO38_LEVEL_HIGH_BITS, 0x02000000
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO38_LEVEL_HIGH_MSB, 25
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO38_LEVEL_HIGH_LSB, 25
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF4_GPIO38_LEVEL_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO38_LEVEL_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO38_LEVEL_LOW_BITS, 0x01000000
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO38_LEVEL_LOW_MSB, 24
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO38_LEVEL_LOW_LSB, 24
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF4_GPIO37_EDGE_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO37_EDGE_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO37_EDGE_HIGH_BITS, 0x00800000
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO37_EDGE_HIGH_MSB, 23
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO37_EDGE_HIGH_LSB, 23
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF4_GPIO37_EDGE_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO37_EDGE_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO37_EDGE_LOW_BITS, 0x00400000
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO37_EDGE_LOW_MSB, 22
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO37_EDGE_LOW_LSB, 22
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF4_GPIO37_LEVEL_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO37_LEVEL_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO37_LEVEL_HIGH_BITS, 0x00200000
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO37_LEVEL_HIGH_MSB, 21
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO37_LEVEL_HIGH_LSB, 21
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF4_GPIO37_LEVEL_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO37_LEVEL_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO37_LEVEL_LOW_BITS, 0x00100000
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO37_LEVEL_LOW_MSB, 20
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO37_LEVEL_LOW_LSB, 20
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF4_GPIO36_EDGE_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO36_EDGE_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO36_EDGE_HIGH_BITS, 0x00080000
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO36_EDGE_HIGH_MSB, 19
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO36_EDGE_HIGH_LSB, 19
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF4_GPIO36_EDGE_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO36_EDGE_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO36_EDGE_LOW_BITS, 0x00040000
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO36_EDGE_LOW_MSB, 18
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO36_EDGE_LOW_LSB, 18
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF4_GPIO36_LEVEL_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO36_LEVEL_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO36_LEVEL_HIGH_BITS, 0x00020000
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO36_LEVEL_HIGH_MSB, 17
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO36_LEVEL_HIGH_LSB, 17
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF4_GPIO36_LEVEL_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO36_LEVEL_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO36_LEVEL_LOW_BITS, 0x00010000
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO36_LEVEL_LOW_MSB, 16
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO36_LEVEL_LOW_LSB, 16
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF4_GPIO35_EDGE_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO35_EDGE_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO35_EDGE_HIGH_BITS, 0x00008000
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO35_EDGE_HIGH_MSB, 15
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO35_EDGE_HIGH_LSB, 15
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF4_GPIO35_EDGE_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO35_EDGE_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO35_EDGE_LOW_BITS, 0x00004000
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO35_EDGE_LOW_MSB, 14
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO35_EDGE_LOW_LSB, 14
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF4_GPIO35_LEVEL_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO35_LEVEL_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO35_LEVEL_HIGH_BITS, 0x00002000
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO35_LEVEL_HIGH_MSB, 13
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO35_LEVEL_HIGH_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF4_GPIO35_LEVEL_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO35_LEVEL_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO35_LEVEL_LOW_BITS, 0x00001000
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO35_LEVEL_LOW_MSB, 12
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO35_LEVEL_LOW_LSB, 12
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF4_GPIO34_EDGE_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO34_EDGE_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO34_EDGE_HIGH_BITS, 0x00000800
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO34_EDGE_HIGH_MSB, 11
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO34_EDGE_HIGH_LSB, 11
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF4_GPIO34_EDGE_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO34_EDGE_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO34_EDGE_LOW_BITS, 0x00000400
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO34_EDGE_LOW_MSB, 10
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO34_EDGE_LOW_LSB, 10
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF4_GPIO34_LEVEL_HIGH
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO34_LEVEL_HIGH_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO34_LEVEL_HIGH_BITS, 0x00000200
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO34_LEVEL_HIGH_MSB, 9
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO34_LEVEL_HIGH_LSB, 9
# -----------------------------------------------------------------------------
# Field       : IO_BANK0_DORMANT_WAKE_INTF4_GPIO34_LEVEL_LOW
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO34_LEVEL_LOW_RESET, 0x0
.equ	IO_BANK0_DORMANT_WAKE_INTF4_GPIO34_LEVEL_LOW_BITS, 0x00000100
